{"pageProps":{"n":"119","plot":{"n":"119","key":"./119/README.md","rustFile":"119/main.rs","content":"<p>This is, like <a href=\"/plots/114\">plot#114</a>, yet another parametric &quot;stack&quot; (using parametric at different scales).\nThis time, the parametric is very noisy. There is a desired effect to make a blur illusion. It&#39;s very fuzzy. I have some glitches on the signature but it&#39;s part of the art now!</p>\n","data":{"title":"Blurry waves","description":"Yet another parametric stack, noisy one this time! white uniball on black A4.","thumbnail":"/images/plots/119.jpg","tags":["parametric"]}},"prev":{"n":"118","key":"./118/README.md","rustFile":"118/main.rs","content":"<p>Continuation of <a href=\"/plots/113\">plot#113</a> with different parametric functions.</p>\n<ul>\n<li>Sakura Gelly Roll white on black. (clairefontaine 210g)</li>\n<li>STA pigment liner 0.05mm on white. (canson bristol A4)</li>\n</ul>\n<p>The black plot have an interesting precision which makes it smooth from a far look but the details of this plot are interesting as well. I&#39;m not yet sure what creates the vertical line glitch we see on both plots, is it the paper? is it my robot? It is part of the art now.</p>\n","data":{"title":"concentric parametric flowers","thumbnail":"/images/plots/118.jpg","tags":["parametric"]}},"next":{"n":"120","key":"./120/README.md","rustFile":"120/main.rs","content":"<p>This is a pretty simple technique, which is almost like a spiral filling, except it&#39;s a parametric (a simple one that is close to a spiral). The idea to render something monochrome with a parametric is interesting, I would like to dig more in future. I also tried it on typography (for a family gift).</p>\n<p>This plot is done with fountain pen and ink &quot;Amber&quot; by Diamine, which I really like.</p>\n<p>When you look closer, there are high frequency noise used to make it more fuzzy.</p>\n<img width=\"100%\" src=\"/images/plots/120_zoom.jpg\">\n","data":{"title":"Bitcoin","description":"a parametric spiral, similar to recent exploration, allows to fill the color of the Bitcoin logo","thumbnail":"/images/plots/120.jpg","tags":["bitcoin"]}}},"__N_SSG":true}