{"pageProps":{"id":"2015-08-04-making-performant-react-applications","year":"2015","month":"08","day":"04","slug":"making-performant-react-applications","content":"<p><em>^ Sorry guys, you may have notice the blog post date is wrong. I won&#39;t change the URL, but thanks to how time works, this will be fixed in one month anyway :-D</em></p>\n<p><a href=\"https://twitter.com/chantastic/status/616608931037646850\">ReactEurope</a> conference\nwas to me incredibly <a href=\"https://twitter.com/chantastic/status/616670658911715328\">inspiring</a> and <a href=\"https://twitter.com/chantastic/status/616995607043903488\">promising</a>.\nYersterday got tons of news and tweets from JavaScript community.</p>\n<p>One tweet and blog post by the great <a href=\"https://twitter.com/aerotwist\">@aerotwist</a> got my attention.</p>\n<blockquote class=\"twitter-tweet\" data-cards=\"hidden\" lang=\"fr\"><p lang=\"en\" dir=\"ltr\">I often hear claims that “the DOM is slow!” and “React is fast!”, so I decided to put that to the test:&#10;&#10;<a href=\"https://t.co/M1RZZiyVT2\">https://t.co/M1RZZiyVT2</a>&#10;&#10;🐢vs🐇</p>&mdash; Paul Lewis (@aerotwist) <a href=\"https://twitter.com/aerotwist/status/616934953679458304\">3 Juillet 2015</a></blockquote>\n\n<p>I would like to express here my opinion and feedback on using React.</p>\n<p>I&#39;ve been using React for almost 2 years now, and always in performance intensive use-cases, from Games to WebGL.</p>\n<a href=\"http://diaporama.glsl.io/\" target=\"_blank\">\n<img src=\"/images/2015/07/diaporama_3.jpg\" alt=\"\" class=\"thumbnail-left\" />\n</a>\n\n<p>I&#39;ve created <a href=\"http://glsl.io/\">glsl.io</a> and I&#39;m working on <a href=\"https://github.com/gre/diaporama-maker\">Diaporama Maker</a>.\nBoth applications are built with React and combined use of HTML, SVG, WebGL.</p>\n<p>Diaporama Maker is probably the most ambitious piece of software I&#39;ve ever personally done.</p>\n<br style=\"clear: left\" />\n\n<blockquote>\n<p>In short, <a href=\"https://github.com/gre/diaporama-maker\">Diaporama Maker</a> it is a WYSIWYG editor for web slideshow (mainly photo slideshows). It is a bit like iMovie with the web as first target. <a href=\"https://github.com/gre/diaporama-maker\">The project is entirely open-sourced.</a></p>\n</blockquote>\n<p>Currently, I am able to render the whole application at 60 FPS and this is still unexpected and surprising to me\n(press Space to run the diaporama on <a href=\"http://diaporama.glsl.io/\">diaporama.glsl.io demo</a>).\nWell, more exactly, this would not have been possible without some optimizations\nthat I&#39;m going to detail a bit at the end of this article.</p>\n<!--more-->\n\n<h2 id=\"the-point-is-productivity\">The point is productivity</h2>\n<p>I don&#39;t think Virtual DOM claims to be faster than doing Vanilla DOM, and that&#39;s not really the point. <strong>The point is productivity.</strong>\nYou can write very well optimized code in Vanilla DOM but this might require <strong>a lot of expertise</strong>\nand a lot of time even for an experienced team <em>(time that should be spent focusing on making your product)</em>.</p>\n<p>When it comes to adding new features and refactoring old ones, this goes worse.\nWithout a well constrained framework or paradigm, things does not scale far, are time consuming and introduce bugs,...\nEspecially in a team where multiple developers have to work with each other.</p>\n<blockquote>\n<p><strong>See Also:</strong> <a href=\"https://www.youtube.com/watch?v=D-ioDiacTm8\">Why does React scale?</a> by <a href=\"https://twitter.com/Vjeux\">@vjeux</a>.</p>\n</blockquote>\n<h2 id=\"what-matters-to-me\">What matters to me</h2>\n<p>There is a lot of advantages of using Virtual DOM approach before talking about React performances.</p>\n<p>Of course, this always depends on what you are building, but I would claim that\n<strong>there is a long way to go using React before experiencing performance issues</strong>,\nand in the worse cases: <strong>you can almost always find easy solutions to optimize these performance issues</strong>.</p>\n<h3 id=\"dx\">DX</h3>\n<p>React has an incredible Developer eXperience (that people seem to call DX nowadays!) that can <a href=\"https://twitter.com/greweb/status/617258379183005696\">help you improving UX</a> and the ability to <a href=\"https://facebook.github.io/react/docs/perf.html\">measure Performances</a> and <a href=\"https://facebook.github.io/react/docs/component-specs.html#updating-shouldcomponentupdate\">optimize them</a> when you reach bottlenecks.</p>\n<p>You can easily figure out which component is a bottleneck in the Component tree as shown in following screenshot.</p>\n<blockquote>\n<p><img src=\"/images/2015/07/diaporama-perfs.png\" alt=\"\">\nWith printWasted() you can see how much time React has wasted to <code>render()</code> something that didn&#39;t change and how much instances has been created. (there is also printInclusive and printExclusive)</p>\n</blockquote>\n<p>This is a bit equivalent of the Web Console Profiler except it emphasis on your application components which is a very relevant approach.</p>\n<h3 id=\"react-data-flow\">React data flow</h3>\n<blockquote>\n<p>I can&#39;t imagine re-writing Diaporama Maker in Vanilla DOM.</p>\n</blockquote>\n<p>In Diaporama Maker, I have a lot of cross dependencies between components,\nfor instance the current <code>time</code> is shared and used everywhere in the application.\nAs a matter of fact, dependencies grow when adding more and more features.</p>\n<blockquote>\n<p><img src=\"/images/2015/07/diaporama_configure_kenburns.gif\" alt=\"\">\nusages of time in 3 independent components.</p>\n</blockquote>\n<p><strong>The descriptive Virtual DOM approach very simply solves this problem</strong>.\nYou just have to pass props in to share data between components:\nthere is one source of trust that climb down your component tree via &quot;props&quot;.</p>\n<p><img src=\"/images/2015/07/diaporama-maker-time-props.jpg\" alt=\"\"></p>\n<p>With Virtual DOM approach, the cost to add one new dependency to a shared data is small and <strong>does not become more complex as the application grows</strong>.</p>\n<blockquote>\n<p><img src=\"/images/2015/07/diaporama_slide_content.gif\" alt=\"\">\nanother more complex showcase of shared states.</p>\n</blockquote>\n<p>Using an Event System like you would do in standard Backbone approach tends to lead to imperative style and spaghetti codes (and when using global events, components are not really reusable).</p>\n<p>Moreover, I think that <code>Views&lt;-&gt;Models</code> Event System approach, if not carefully used, tends to converge to an unmaintainable and laggy applications.</p>\n<h3 id=\"react-is-a-component-library\">React is a Component library</h3>\n<p>React truly offers <strong>component as first-class citizen</strong>.\nThis means it allows component reusability. I&#39;ve tried alternative like virtual-dom and I don&#39;t think it emphasizes enough on this benefit.</p>\n<p>There are <a href=\"https://twitter.com/chantastic/status/616997918155759616\">important good practices</a> when using React like minimizing states and props and I&#39;m not going to expand more on this subject. Most of these best practices are not exclusive to React but come from common sense and software architecture in general.\nOne of the important point for performance is to <strong>choose a good granularity of your component tree</strong>.\nIt is generally a good idea to split up a component into pieces as small as possible\nbecause it allows to separate concerns, minimize props and consequently optimize rendering diff.</p>\n<h4 id=\"diaporama-maker-architecture\">Diaporama Maker architecture</h4>\n<p>You would be surprised to know that Diaporama Maker does not even use <strong>Flux</strong> (that might be reconsidered soon for collaborative features). I&#39;ve just taken the old &quot;callback as props&quot; approach all the way down the component tree. That easily makes all components purely modular and re-usable (no dependencies on some Stores).\nI&#39;ve also taken the <a href=\"\">inline style approach</a> without actually using any framework (this is just about props-passing <code>style</code> objects).</p>\n<p>As a consequence, I&#39;ve been able to externalize a lot of tiny components that are part of my application\nso I can share them across apps and also in order to people to re-use them.</p>\n<p>What is important about externalizing components is also the ability to test and optimize them independently (the whole idea of modularity).</p>\n<p>Here are all the standalone UI components used by Diaporama Maker:</p>\n<ul>\n<li><a href=\"https://github.com/gre/bezier-easing-editor\">bezier-easing-editor</a></li>\n<li><a href=\"https://github.com/gre/bezier-easing-picker\">bezier-easing-picker</a></li>\n<li><a href=\"https://github.com/glslio/diaporama-react\">diaporama-react</a></li>\n<li><a href=\"https://github.com/glslio/glsl-transition-vignette\">glsl-transition-vignette</a></li>\n<li><a href=\"https://github.com/glslio/glsl-transition-vignette-grid\">glsl-transition-vignette-grid</a></li>\n<li><a href=\"https://github.com/gre/glsl-uniforms-editor\">glsl-uniforms-editor</a></li>\n<li><a href=\"https://github.com/gre/kenburns-editor\">kenburns-editor</a></li>\n</ul>\n<p>(each one have standalone demos)</p>\n<h2 id=\"optimizing-performances\">Optimizing performances</h2>\n<blockquote class=\"twitter-tweet\" lang=\"fr\"><p lang=\"en\" dir=\"ltr\">I&#39;ve been working on crazy projects using React (like <a href=\"http://t.co/U2oETh5lhZ\">http://t.co/U2oETh5lhZ</a> ). most performance issues i&#39;ve met was not because of React</p>&mdash; Gaëtan Renaudeau (@greweb) <a href=\"https://twitter.com/greweb/status/617210444839809024\">4 Juillet 2015</a></blockquote>\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>Here are 2 examples of optimizations I had to do in Diaporama Maker that are not because of React:</p>\n<ul>\n<li>It is easy to write not very optimized WebGL, so I work a lot to optimize the pipeline of <a href=\"https://github.com/gre/diaporama\">Diaporama engine</a></li>\n<li>CSS transforms defined on Library images was for a time very intensive for the browser to render so I am now using server-resized &quot;thumbnails&quot; instead of the full-size images. Asking the browser to recompute the <code>transform: scale(...)</code> of 50 high resolution images can be super costy. (without this optimization, the resize of the application was running at like 2-3 FPS because the library thumbnails need to recompute their scale and crop).</li>\n</ul>\n<p>But what if you still have performance issue due by React? Yes this can happens.</p>\n<h3 id=\"timeline-grid-example\">Timeline Grid example</h3>\n<p>In Diaporama Maker, I have a Component that generates a lot of elements (like 1300 elements for a 2 minutes slideshow) and my first naive implementation was very slow. This component is <a href=\"https://github.com/gre/diaporama-maker/blob/b0c6447b127785bea3c2487b0c77037418298b8c/client/ui/TimelineGrid/index.js\">TimelineGrid</a> which renders the timescale in the timeline. It is implemented with SVG and a lot of <code>&lt;text&gt;</code> and <code>&lt;line&gt;</code>.</p>\n<p>The performance issue was noticeable when drag and dropping items across the application. React was forced to render() and compare the whole timescale grid every time. But the timescale does not change! it just have 3 props:</p>\n<pre><code class=\"language-xml\">&lt;TimelineGrid timeScale={timeScale} width={gridWidth} height={gridHeight} /&gt;\n</code></pre>\n<p><strong>So it was very easy to optimize it just by using the <code>PureRenderMixin</code> to say to react that all my props are immutable.</strong>\n(I could have implemented <code>shouldComponentUpdate</code> too).</p>\n<p>After this step, and for this precise example, I don&#39;t think a Vanilla DOM implementation can reach better performance:</p>\n<ul>\n<li>when one of the grid parameter change, <strong>EVERYTHING</strong> need to be recomputed because all scales are changing.</li>\n<li>React is doing even smarter thing that I would not manually do? Like reusing elements instead of destroying/creating them.</li>\n</ul>\n<p>There might still be ways to go more far in optimizing this example. For instance I could chunk my grid into pieces\nand only render the pieces that are visible, like in an infinite scroll system <em>(I could use something like <a href=\"https://github.com/gre/sliding-window\">sliding-window</a> for this)</em>.\nThat would probably be premature optimization for this example.</p>\n<h2 id=\"wrap-up\">Wrap Up</h2>\n<p>To my mind, generic benchmarks always tends to be biased and does not represent use-cases reality unless you are really covering your application itself.</p>\n<p>The TimelineGrid component optimization explained in this article is a very specific and well chosen example,\nbut it is one counter-example for such a benchmark.</p>\n<p>Each application has its own needs and constraints and we can&#39;t really generalize one way to go.\nAlso Performance should not be the main concern to choose a technology.</p>\n<p>It is easy to make Virtual DOM library benchmarks,\ncomparing the performance of rendering and Array diffing,\nbut does that covers 80% of use-cases?\nIs performance really the point?\nWhat tradeoff do you accept to make between Performance and Productivity?</p>\n<p>Tell me what you think.</p>\n<p>In the meantime, I think we can all continue getting applications done\nand <a href=\"https://github.com/gaearon/react-hot-loader\">developing amazing DX</a>.</p>\n","data":{"title":"Making performant React applications","description":"I would like to express here my opinion and feedback on using React and performance optimization you can do.","thumbnail":"/images/2015/07/diaporama_3.jpg","author":"Gaetan","layout":"post","tags":["react","vdom"]}},"__N_SSG":true}