{"pageProps":{"id":"2014-05-04-ld29","year":"2014","month":"05","day":"04","slug":"ld29","content":"<img class=\"thumbnail-left\" src=\"/images/2014/05/computer_preset.jpg\" alt=\"\">\n\n<p>I <strong>gamejam-ed</strong> last weekend to the <a href=\"http://ludumdare.com/compo/\">Ludum Dare</a> \ntheming <em>&quot;Beneath the Surface&quot;</em> (29th edition).</p>\n<p>I enjoyed that time a lot.\nWhat changed from the previous Ludum Dare for me is that \n<strong>I&#39;m now</strong> —and happy to be— <strong>a father</strong>,\nand I&#39;m enough trained to wake up at 3am so I could be there attending the beginning!</p>\n<p>This article is my diary of this incredible 48 hours past to\ndevelop <strong>&quot;Anthill&quot;, a minimalist anthill simulation game</strong>.\nThis postmortem will explain what <a href=\"/2014/05/ld29/#right\">went right</a> and what <a href=\"/2014/05/ld29/#wrong\">went wrong</a>\nfor this compo.</p>\n<h1 id=\"the-game\">The Game</h1>\n<p>I haven&#39;t played any Ant Simulation Game \nbut I recently played a lot <a href=\"http://www.shiningrocksoftware.com/\">&quot;Banished&quot;</a>,\nan awesome city-building strategy game,\nand I was inspired by the &quot;assign jobs to people&quot; gameplay of this game.</p>\n<ul>\n<li><strong><a href=\"http://greweb.me/ld29/\">Play the Game</a></strong></li>\n<li><a href=\"http://www.ludumdare.com/compo/ludum-dare-29/?action=preview&amp;uid=18803\">Ludum Dare entry</a></li>\n<li><a href=\"//github.com/gre/ld29/\">Source code</a></li>\n</ul>\n<iframe width=\"640\" height=\"360\" src=\"http://www.youtube.com/embed/DBt-5Qmzu1k?feature=player_embedded\" frameborder=\"0\" allowfullscreen></iframe>\n\n<h1 id=\"timelapse\">Timelapse</h1>\n<p>Developing a complete game in 48 hours (including sleeping) is tough,\nespecially that it is also about making the graphics and the music!</p>\n<p>The game resulting of these 2 days is more a <strong>prototype</strong> than a finished game:\nthe simulation remains minimalist and fastly boring,\nthe food is the only resource you have to care about.</p>\n<p>Here is a <strong>300x accelerated screencast of the developement of &quot;Anthill&quot;</strong>:</p>\n<iframe width=\"640\" height=\"360\" src=\"http://www.youtube.com/embed/VhH7of4gAHk?feature=player_embedded\" frameborder=\"0\" allowfullscreen></iframe>\n\n<!--more-->\n\n<h2 id=\"-what-went-right\"><a name=right></a> What went right</h2>\n<h3 id=\"music\">Music</h3>\n<p>Best achievement of my LD entry was –to me– <strong>making the music</strong>.</p>\n<img class=\"thumbnail-left\" src=\"/images/2014/05/music_preset.jpg\" alt=\"\">\n\n<p>I&#39;m not a musician, neither a pianist, but I played a lot with <a href=\"/tags/audio/\">Audio</a> the past year and I&#39;ve managed to make a music for this game —and had a lot of fun making it.\nI&#39;ve used my <em>Yamaha P105</em> as a MIDI controller for making the game music and connecting it \nto <a href=\"http://www.warmplace.ru/soft/sunvox/\">SunVox</a>, a modular tracker software.</p>\n<h4 id=\"play-the-music---feedback-appreciated\">Play the music - feedback appreciated</h4>\n<iframe width=\"100%\" height=\"450\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/playlists/32426683&amp;auto_play=false&amp;hide_related=false&amp;visual=true\"></iframe>\n\n<img class=\"thumbnail-right\" src=\"/images/2014/05/playing_midi.png\" alt=\"\">\n\n<p>Most of the notes you heard have been <strong>recorded live from my hand</strong>, and I was quite proud of that, because I&#39;m quite a noob on a piano.\nDoing that way, you keep some imperfection in the music (little delay on the notes, especially in the intro music) and I think that sometimes makes the music better.</p>\n<p>I&#39;ve talked a few times about SunVox, also <a href=\"/2013/07/zound-live/\">I still want to make my own web version</a> \nof a <strong>modular audio tracker</strong> that anyone (first myself!) could use \nand also could embed live in the game (and, for instance, having game variable impacting the audio experience).</p>\n<h3 id=\"graphics\">Graphics</h3>\n<p>Also, I&#39;m more a developer than a graphist so I would say this was a success^^</p>\n<blockquote class=\"twitter-tweet\" lang=\"fr\"><p>My best <a href=\"https://twitter.com/search?q=%23gamedev&amp;src=hash\">#gamedev</a> graphics ever! <a href=\"http://t.co/FksRoq1r9x\">pic.twitter.com/FksRoq1r9x</a></p>&mdash; Gaëtan Renaudeau (@greweb) <a href=\"https://twitter.com/greweb/statuses/460558902812086272\">27 Avril 2014</a></blockquote>\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<h3 id=\"using-a-library\">Using a library</h3>\n<p>I&#39;ve entirely <strong>focused on making my game</strong> rather than making the technical stack.\nUsually, I tend to develop my own framework with the game.\nIt is good to learn and discover some <a href=\"/2014/01/promisify-your-games/\">cool ways of programming a game</a>\nbut this time I really wanted to get things done...</p>\n<h3 id=\"phaserio\">Phaser.io</h3>\n<p>...so I&#39;ve used <strong><a href=\"http://www.phaser.io/\">Phaser</a></strong> which is a trendy and awesome framework.\nIt is also built on top of the <strong>Pixi.js</strong> rendering library (I used in <a href=\"http://www.ludumdare.com/compo/ludum-dare-27/?action=preview&amp;uid=18803\">LD27</a>) and <strong>p2.js</strong> physics engine,\nwhich are two brillant and performant JavaScript libraries.</p>\n<p>Hopefully I started my project with a &quot;Phaser template&quot; I bootstraped during the previous warmup weekend.\nI&#39;ve still lost some time playing with the Phaser API but I could have relied on Phaser features and performance so I think it worth it the second day.</p>\n<h3 id=\"google-hangout-with-ludum-dare-friends\">Google Hangout with Ludum Dare friends</h3>\n<p>I used Google Hangout during the whole Ludum Dare, as a way to put my webcam in the timelapse, \nbut more importantly to have other Ludum Dare friends coming in it!</p>\n<p>This was a cool first experiment as an alternative to the &quot;stream my dev&quot; approach.\nIt was quite fun and social to have <a href=\"http://twitter.com/mrspeaker\">@mrspeaker</a>\nshowing me his crazy Metal Meter game advancement.</p>\n<p><img src=\"/images/2014/05/hangout.png\" alt=\"\"></p>\n<h2 id=\"-what-went-wrong\"><a name=wrong></a> What went wrong</h2>\n<h3 id=\"achievability\">Achievability</h3>\n<p><strong>My <a href=\"https://github.com/gre/ld29/blob/master/TODO.md\">initial plan</a> was too ambitious.</strong>\nIt seems to always happen with me: I get the first day a lot of ideas and motivation, and I tend to underestimate the work to be done. Then at the end of the first day, I&#39;m frustrated to find out I won&#39;t have enough time to do all my plans.\nIndeed it is good to have a lot of ideas but, next Ludum Dare, I&#39;ll try to be sure to have achievable goals.</p>\n<blockquote>\n<p>Next time, let&#39;s <strong>remove half the features</strong> I establish!</p>\n</blockquote>\n<p>So, the second day morning, I&#39;ve been replanning from scratch and reprioritize my features to basically have something finished and working as a game.\nBecause of this decision, the result you can see is a game, but far from the one I originally wanted. \n<strong>This version is only about digging, collecting mushrooms and avoiding stravation</strong>.</p>\n<p>Also I originally scheduled to work that way <strong>Day 1: developing-only, Day 2: music and graphics + new features</strong>. I&#39;m not sure this approach can really works, especially it doesn&#39;t scale, we better work by adding complete features one after the other. That theorically works, but it is however difficult to apply in practice with the stress of the Ludum Dare countdown!</p>\n<h3 id=\"path-finding-performance\">Path finding performance</h3>\n<p><strong>Implementing my own path finding algorithm was fast but not optimal</strong> at all because of performances!\nI recently released a bugfixed version which just use an existing <a href=\"http://qiao.github.io/PathFinding.js/visual/\">path finding library</a> to fix my bad implementation \nand also to avoid an ant to request path finding each frame when looking for a task to be affected on.</p>\n<h3 id=\"finding-the-good-simulation-parameters\">Finding the good simulation parameters</h3>\n<p>I underestimated a bit the amount of work needed to find the good parameters of the simulation.\nThose are very important to <strong>make the game well-balanced</strong> (e.g. not impossible but also not super-easy), I don&#39;t think I found the optimal parameter in the released version.</p>\n<p>I think I need two important things to make this parameter search easier:</p>\n<ul>\n<li>a framework to maintain parameters presets and change them live.</li>\n<li>make the simulation running at any speed to ease the development. (faster simulation)</li>\n</ul>\n<h3 id=\"bug-a-task-is-not-always-completed-by-the-closest-ant\">[bug] A task is not always completed by the closest ant</h3>\n<p>There is a inconvenient <strong>proximity bug</strong> in my game that you may have noticed:\nwhen a new job is created, it may happen that, even if a ant was here nearby, a very far ant is assigned to this job.</p>\n<p>I&#39;m using a <code>foreach ant in noJobAnts { findAntTask(ant,availableTasks) }</code> loop.\nIn this first approach, even if a ant will take the closest task in <code>findAntTask</code>, the first assigned ant will occupy the task even if a closer ant was after in the noJobAnts list.</p>\n<p>Another approach to solve this issue would be to do <code>foreach task in availableTasks { findTaskAnts(task,noJobAnts) }</code>.\nIn this second approach, the <code>findTaskAnts</code> should sort the noJobAnts list for the given task proximity.</p>\n<p>However it is not that trivial because tasks also have different priorities for a given ant, and <code>findAntTask</code> solved that.\nIn my original plan, there is some basic tasks like &quot;clean the dirt&quot; or &quot;clean the corpse&quot; which can be done by any ant. However, a specialized ant (let&#39;s say an Harvester) may have some more important tasks to be done first, so this is why we need this priority.</p>\n<p>In other word, fixing this bug is not trivial and I need to find the optimal loop for that!</p>\n<h2 id=\"to-be-continued\">To be continued...</h2>\n<p>I really wish to continue this game because I enjoyed making it and I would enjoy playing the one I have in mind! \nTime will tell if I can accomplish that wish!</p>\n<p><img src=\"/images/2014/05/anthill.png\" alt=\"\"></p>\n<h2 id=\"you-can-make-games\">You can make games!</h2>\n<p>I strongly think anyone a bit motivated and inspired can participate <a href=\"http://ludumdare.com/compo/\">Ludum Dare</a>.</p>\n<p>Whoever you are, you can make games!</p>\n<ul>\n<li>If you are a developer, you can develop games easily! But that&#39;s not enough, you will require graphics and music!</li>\n<li>If you are a graphist, you can make crazy beautiful games! There is tools to help you making the game without coding.</li>\n<li>If you are a game designer or story teller, you can make awesome games too! You could also just make a cool text adventure game?</li>\n</ul>\n<iframe width=\"640\" height=\"480\" src=\"//www.youtube.com/embed/PVbCECjxFds\" frameborder=\"0\" allowfullscreen></iframe>\n","data":{"title":"48 hours to prototype an Ant Sim Game","description":"I gamejam-ed last weekend to the Ludum Dare 29 theming \"Beneath the Surface\" to develop \"Anthill\", a minimalist anthill simulation game.","thumbnail":"/images/2014/05/anthill.png","author":"Gaetan","layout":"post","tags":["gamedev","ludumdare","javascript","phaser"]}},"__N_SSG":true}