{"pageProps":{"n":"117","plot":{"n":"117","key":"./117/README.md","rustFile":"117/main.rs","content":"<p>Another exploration of <a href=\"/plots/112\">plots#112</a>, more delicate than <a href=\"/plots/115\">plots#115</a>, with a centered noise of fibers. It uses two fountain pen inks for different color tones (Aurora Borealis and Writer&#39;s Blood from Diamine). I could try with even more lines in future but these are already almost 2 hours of plotting time! A4 on Bristol.</p>\n","data":{"title":"Noisy fibers","thumbnail":"/images/plots/117.jpg","description":"Exploration of fibers with a centered noise. two color tones.","tags":["fibers","perlin"]}},"prev":{"n":"116","key":"./116/README.md","rustFile":"116/main.rs","content":"<p><strong>Exploration of perlin noise triangle planets. various fountain pen on A4 bristol.</strong></p>\n<p>These are taking almost one hour to plot, with 2 passes of 2 different spirals. Each spiral varies a bit with different offset and displacement noise which creates a desired effect of bolder areas, caveats and craters.</p>\n<p>The displacement noise is a simple perlin noise, only one harmony is used but the noise is split into two 2 different perlin noises: the angle noise (like a vector field, different angle of displacement) and the amplitude noise (how much does the displacement move the point).</p>\n<p>The triangle is made with a parametric function, reusing technique explored on <a href=\"/plots/114\">plot#114</a>.\nThere is an important effort on finding a good balance between noise and distribution of lines (it&#39;s not linear, it&#39;s closer on edges).</p>\n","data":{"title":"Triangle planet","thumbnail":"/images/plots/116.jpg","description":"Exploration of perlin noise triangle planets. various fountain pen on A4 bristol.","tags":["parametric","perlin","planet"]}},"next":{"n":"118","key":"./118/README.md","rustFile":"118/main.rs","content":"<p>Continuation of <a href=\"/plots/113\">plot#113</a> with different parametric functions.</p>\n<ul>\n<li>Sakura Gelly Roll white on black. (clairefontaine 210g)</li>\n<li>STA pigment liner 0.05mm on white. (canson bristol A4)</li>\n</ul>\n<p>The black plot have an interesting precision which makes it smooth from a far look but the details of this plot are interesting as well. I&#39;m not yet sure what creates the vertical line glitch we see on both plots, is it the paper? is it my robot? It is part of the art now.</p>\n","data":{"title":"concentric parametric flowers","thumbnail":"/images/plots/118.jpg","tags":["parametric"]}}},"__N_SSG":true}