{"pageProps":{"n":"672","plot":{"n":"672","key":"./672/README.md","rustFile":"672/main.rs","sourceURL":"https://github.com/gre/gre/blob/master/plots/examples/672/main.rs","content":"<blockquote>\n<p>Ce weekend du 24 Septembre 2022 a eu lieu le premier <a href=\"https://twitter.com/ArtRushEvent\">évènement &quot;Art Rush&quot;</a> organisé par des streamers de la communauté Twitch FR Art. Ce fût l&#39;occasion de faire de superbes rencontres et également de pouvoir approfondir ma technique et partager mon travail. Le thème était &quot;Années 80&quot;.</p>\n</blockquote>\n<p>J&#39;ai réalisé cette scène tracée au stylo plume sur papier aquarelle grand format (70 par 50 centimètres), en utilisant 6 encres Diamine: <em>Bloody Brexit, Amber, Imperial Purple, Soft Mint, Turquoise, Flamingo Pink</em>.</p>\n<p>Plusieurs variantes, petits formats, ont également été produites:</p>\n<img src=\"/images/plots/672-a6-plots.jpg\" width=\"100%\"/>\n\n<h3 id=\"réalisé-au-robot-traceur-plotter\">Réalisé au robot traceur (plotter)</h3>\n<p>Comme tout mes travaux, un traceur a été utilisé pour dessiner tout les traits. Cela a pris approximativement 10 heures.</p>\n<p><video src=\"/images/plots/672-timelapse.mp4\" width=\"100%\" controls autoplay muted loop></video></p>\n<h3 id=\"lart-génératif\">L&#39;art génératif?</h3>\n<p>Comme cet aperçu le montre, une infinité de variantes aurait pu être physiquement réalisé:</p>\n<p><video src=\"/images/plots/672-digital.mp4\" width=\"100%\" controls autoplay muted loop></video></p>\n<p>Cette technique s&#39;appelle l&#39;art génératif: j&#39;ai en fait écris un programme qui utilise l&#39;aléatoire pour placer les néons et construire les montagnes.</p>\n<p>Ce programme est développé avec du &quot;code créatif&quot; (en Rust) et va utiliser un RNG, des algorithmes, pour constituer tout les éléments de la scène finale.</p>\n<p>Il sauvegarde un fichier vectoriel (.SVG) qui peut ensuite être donné au robot pour tracer tout les traits au stylo plume.</p>\n<img src=\"/images/plots/672-curation.jpg\" width=\"100%\"/>\n\n<p>Le rendu digital est ainsi seulement théorique car les encres utilisés dans les contraintes du physique vont enrichir la réalisation. Théorique VS Physique:</p>\n<p><img src=\"/images/plots/672-digital.jpg\" width=\"50%\"/><img src=\"/images/plots/672.jpg\" width=\"50%\"/></p>\n<h2 id=\"making-of\">Making of</h2>\n<h3 id=\"vendredi-2-prototypes-pour-explorer-la-texture-des-néons\">Vendredi: 2 prototypes pour explorer la texture des &quot;Néons&quot;</h3>\n<p>Je me suis d&#39;abord concentré sur les encres qui serait intéressant pour représenter le thème &quot;années 80&quot;. Deux prototypes sont réalisé pour tester ces couleurs:</p>\n<img src=\"/images/plots/668.jpg\" width=\"100%\"/>\n\n<p>Ce premier prototype explore le pavage de cercles concentriques dans des zones rectangulaires différentes. La superposition de plusieurs pavages (déjà exploré dans <a href=\"/plots/667\">/plots/667</a>) offre plus de profondeur et de densité et permet de jouer avec le désordre.</p>\n<p>Un deuxieme prototype est créé en reprenant ce même principe mais sur de tout petit cercles remplis de spirales:</p>\n<img src=\"/images/plots/670.jpg\" width=\"100%\"/>\n\n<p>Le résultat est assez surprenant car il y a un certain ordre dans ce placement aléatoire.</p>\n<p><video src=\"/images/plots/670-timelapse.mp4\" width=\"100%\" controls autoplay muted loop></video></p>\n<blockquote>\n<p>Pour la petite anecdote, une partie d&#39;une roue de mon traceur s&#39;est cassé pendant cette réalisation!</p>\n</blockquote>\n<h3 id=\"samedi-réalisation-du-générateur\">Samedi: réalisation du générateur</h3>\n<p>Le samedi a été crutial car c&#39;est le jour où j&#39;ai composé la scène finale. L&#39;idée s&#39;inspire du meme &quot;Hacker Man&quot; et principalement du premier film &quot;TRON&quot;.</p>\n<img src=\"/images/plots/672-draft.jpg\" width=\"100%\"/>\n\n<blockquote>\n<p>Savez vous que le bruit de perlin (Perlin Noise) a été conçu par Ken Perlin pour les textures du film TRON? L&#39;utilisation de telle texture procédurale est un outil fondamental dans l&#39;art génératif, et c&#39;est ce qui me permet ici de lever mes montagnes.</p>\n</blockquote>\n<p>Un générateur est développé (environ 3 heures investis à l&#39;écrire), programme qui me permet de générer une infinité de variations.</p>\n<h3 id=\"dimanche-sélection-dun-variant-réalisation-physique\">Dimanche: sélection d&#39;un variant, réalisation physique</h3>\n<p>Le dernier jour est consacré à finaliser la scène, il y a une sélection artistique à faire pour choisir une des variations qui me semble intéressant (subjectivement), j&#39;ai choisi le numéro 2772 qui sera donc &quot;l&#39;élu&quot; présenté plus haut. (après donc avoir généré 2771 précédents variations)</p>\n<p>Le papier que j&#39;ai utilisé a été au début assez compliqué car il n&#39;absorbait pas suffisamment l&#39;encre:</p>\n<img src=\"/images/plots/672-begin.jpg\" width=\"100%\"/>\n\n<p>J&#39;ai dû repassé une deuxième fois pour améliorer le soleil, la version finale a toujours un peu le trait visible, c&#39;est aussi ce qui fait le charme du médium.</p>\n<p>Pendant que le grand tracé (70x50cm) était en cours de traçage, il fût intéressant d&#39;éprouver le générateur sur un format plus petit: voici 4 variantes sur format carte postale:</p>\n<img src=\"/images/plots/672-a6-plots.jpg\" width=\"100%\"/>\n\n<p>Il est intéressant de constater le comportement des encres. Voici quelques zooms:</p>\n<img src=\"/images/plots/672z-a6.jpg\" width=\"100%\"/>\n<img src=\"/images/plots/672z1.jpg\" width=\"100%\"/>\n<img src=\"/images/plots/672z2.jpg\" width=\"100%\"/>\n<img src=\"/images/plots/672z3.jpg\" width=\"100%\"/>\n<img src=\"/images/plots/672z4.jpg\" width=\"100%\"/>\n\n<h3 id=\"conclusion\">Conclusion</h3>\n<p>J&#39;ai été très satisfait de l&#39;organisation de &quot;Art Rush&quot;. J&#39;ai aimé la bonne ambiance et les échanges que j&#39;ai pu avoir en découvrant aussi d&#39;autres artistes aux techniques très variés. J&#39;ai hâte de revoir les VOD car j&#39;étais très plongé dans ma propre créa.</p>\n<p>Je vous invite à regarder les contenus partagés par <a href=\"https://twitter.com/ArtRushEvent\">https://twitter.com/ArtRushEvent</a></p>\n","data":{"date":"2022-09-25","title":"Néons (artrush event)","image":"/images/plots/672.jpg","description":"","tags":["artrush"]}},"prev":{"n":"671","key":"./671/README.md","rustFile":"671/main.rs","sourceURL":"https://github.com/gre/gre/blob/master/plots/examples/671/main.rs","content":"<img src=\"/images/plots/671bis.jpg\" width=\"100%\"/>\n\n<p>Made in 1 hour during a speed run inside the &quot;Art Rush&quot; weekend event!</p>\n<p>streamed on twitch.</p>\n<p><video src=\"/images/plots/671-timelapse.mp4\" width=\"100%\" controls autoplay muted loop></video></p>\n","data":{"date":"2022-09-25","title":"Ink Trees (Live Experiment)","image":"/images/plots/671.jpg","tags":["artrush"]}},"next":null},"__N_SSG":true}