{"pageProps":{"id":"2013-08-21-FM-audio-api","year":"2013","month":"08","day":"21","slug":"FM-audio-api","content":"<p>The main principle of <a href=\"http://en.wikipedia.org/wiki/Frequency_modulation_synthesis\">Frequency Modulation (FM)</a> is to <strong>pipe an Oscillator (the Modulator)\ninto the frequency of another Oscillator (the Carrier)</strong>.</p>\n<p>This article will explain to you how FM Synthesis works with <strong>interactive demos</strong>.\nIn the meantime, all demos are implemented with the brand new <strong>Web Audio API</strong>,\nso feel free to hack the code for your own purpose.</p>\n<p>This article will also introduce some Audio concepts like <strong>LFO</strong>, <strong>Envelope</strong> and <strong>Finetuning</strong>.</p>\n<p>I&#39;ve recently implemented a very first FM in <a href=\"/2013/07/zound-live/\">ZOUND live</a> - <em>a HTML5 collaborative audio tracker</em>,\ngiving much more powerful Synthesizers (see in the following video).</p>\n<iframe width=\"640\" height=\"480\" src=\"//www.youtube.com/embed/El4JvaDWQUM\" frameborder=\"0\" allowfullscreen></iframe>\n[*(here is the implementation of that FM)*][zoundfm]\n\n\n<!--more-->\n\n<h2 id=\"dive-into-frequency-modulation-synthesis\">Dive into Frequency Modulation Synthesis</h2>\n<p>As mentioned previously, FM is about <strong>piping an Oscillator (the <u>Modulator</u>) into the frequency of another Oscillator (the <u>Carrier</u>)</strong>.</p>\n<p>The Modulator oscillation only affects the oscillation frequency of the Carrier but is not directly an audio signal.</p>\n<p><img src=\"/images/2013/08/fm_principle.png\" alt=\"\"></p>\n<p>The result of that modulation differs depending on each oscillator <strong>frequency</strong> and <strong>amplitude</strong>:</p>\n<p><a href=\"http://en.wikipedia.org/wiki/File:Frequencymodulationdemo-td.png\"><img src=\"/images/2013/08/Frequencymodulationdemo-td.png\" alt=\"\"></a></p>\n<p><em><strong>N.B.</strong></em> <em>Our interactive demos in this article will always play a sound and visualize it (waveform / spectrum analyzer).\nYou will have different kind of controls depending on each specific aspect I want to illustrate.</em></p>\n<p><em>The demos should work on Chrome. <strong>However if you get an AudioContext failure, please reload the page</strong> (you may not be able to start them all in one row).</em></p>\n<h3 id=\"lfo\">LFO</h3>\n<p><strong>Low-Frequency Oscillation (LFO)</strong> is very used in electronic music for making rythmic audio effects.</p>\n<p>LFO is simply a specific subset of a oscillator in a sense that <strong>its oscilation frequency is under\nthe human audible range (20 Hz)</strong> and is then not generally used as an audio signal but as an effect controller.</p>\n<p>For instance the frequency / the amplitude of an oscillator, or in the following example the frequency of the cut-off filter:</p>\n<p><audio src=\"http://upload.wikimedia.org/wikipedia/commons/e/e4/Lfo-cutoff-frequency-wobble-bass.ogg\" controls></audio></p>\n<p>Now, as a first demo,\nlet&#39;s see what happens if our <strong>FM Modulator is an LFO</strong>,\n<em>(i.e. if that Modulator is in low frequency range)</em>.</p>\n<iframe width=\"100%\" height=\"310\" src=\"http://fiddle.jshell.net/FvnJx/58/show/light/\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\"></iframe>\n<a href=\"http://jsfiddle.net/FvnJx/58/\" target=\"_blank\" style=\"display: block; text-align: right\">Open on jsfiddle</a>\n\n<p>Observe in the Carrier graphs how <strong>the waveform is regulary compressed and decompressed</strong>. If you increase the Modulator frequency, it will speed up this effect. A real FM is about speeding up that effect up to the audible range...</p>\n<p><em><strong>N.B.</strong></em> <em>With <em>Web Audio API</em> (more generally with any modular synthesizers) we can easily control any module parameter with an LFO:</em></p>\n<pre><code class=\"language-javascript\">lfo.connect(carrier.frequency);\n</code></pre>\n<h4 id=\"modulator-in-audible-range\">Modulator in audible range</h4>\n<p>Now, if we increase the frequency to the hearing range, here is what happens:\n<em>(in that example you can also change the Carrier frequency)</em></p>\n<iframe width=\"100%\" height=\"310\" src=\"http://fiddle.jshell.net/x4CWR/36/show/light/\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\"></iframe>\n<a href=\"http://jsfiddle.net/x4CWR/36/\" target=\"_blank\" style=\"display: block; text-align: right\">Open on jsfiddle</a>\n\n\n<p>It&#39;s as if that <strong>once the Modulator reaches that audible barrier, it kind of becomes a second audible synthesizer</strong>,\neven if it only modulate the frequency of the actual synthesizer.\nHowever, it&#39;s completely different than playing the two synthesizers directly into the output,\nagain the modulator influence the frequency of the carrier and is not directly piped into the output audio signal.</p>\n<p><em>There is especially cool sound produced when the Modulator frequency is closed to the Carrier frequency. For more infos, see the <u>Finetuning</u> section.</em></p>\n<h3 id=\"frequency-ratios-harmonic-or-dissonant-sounds\">Frequency ratios: harmonic or dissonant sounds</h3>\n<p>One thing you may also have notice in the previous example is that most of the generated sounds was quite dissonant, non harmonic.</p>\n<p>Now, if we add more restrictions and only <strong>snap the possible modulator frequencies</strong>\nto a <strong>multiple of the carrier frequency</strong>, here is what happens:</p>\n<iframe width=\"100%\" height=\"310\" src=\"http://fiddle.jshell.net/Euezv/17/show/light/\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\"></iframe>\n<a href=\"http://jsfiddle.net/Euezv/17/\" target=\"_blank\" style=\"display: block; text-align: right\">Open on jsfiddle</a>\n\n<p>This harmonic result is due a simple fact in music: <strong>Mutiplying a note frequency by 2 is equivalent to Increasing that note by one octave,</strong> meaning the note has the same tone but is one-octave higher. (and vice versa for the division). <em>BTW, you may have noticed that fact by repetition of peaks in the previous example Spectrum Visualization.</em></p>\n<p>Now we can release some restrictions by also allowing frequencies multiple of <code>carrier frequency / 4</code>, which means allowing to increase/decrease by an <strong>octave</strong>, a <strong>semi-octave</strong> or a <strong>quarter-of-octave</strong>.</p>\n<iframe width=\"100%\" height=\"310\" src=\"http://fiddle.jshell.net/DFSwN/13/show/light/\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\"></iframe>\n<a href=\"http://jsfiddle.net/DFSwN/13/\" target=\"_blank\" style=\"display: block; text-align: right\">Open on jsfiddle</a>\n\n\n<p><em>Eventually you could even allow more freedom using multiple of <code>carrier freq / 12</code>, because an octave is equally divided by 12 in the <a href=\"http://en.wikipedia.org/wiki/Chromatic_scale\">Chromatic scale</a>.</em></p>\n<h3 id=\"mixing-the-power-of-the-modulator-effect\">Mixing the power of the Modulator effect</h3>\n<p>A very interesting part of the job is also to change the <strong>amplitude of the modulator</strong>. So far, we used a full amplitude modulating the carrier frequency from 0 to 2-times its original frequency which produces a quite rough sound.</p>\n<p>Try to change the modulator amplitude on the following demo:</p>\n<iframe width=\"100%\" height=\"310\" src=\"http://fiddle.jshell.net/DAT5S/12/show/light/\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\"></iframe>\n<a href=\"http://jsfiddle.net/DAT5S/12/\" target=\"_blank\" style=\"display: block; text-align: right\">Open on jsfiddle</a>\n\n<p>Technically, we can easily control that range to any by changing the gain of the Modulator with a <code>GainNode</code> which is just a tool to scale the amplitude of a signal.</p>\n<h3 id=\"envelope\">Envelope</h3>\n<p>Now, we need to add an <strong>Envelope</strong> for automating that amplitude change you just experiment with.</p>\n<p>An envelope in electronic music will generally look like this:</p>\n<p><a href=\"http://en.wikipedia.org/wiki/File:ADSR_parameter.svg\"><img src=\"/images/2013/08/500px-ADSR_parameter.svg.png\" alt=\"\"></a></p>\n<p>An Envelope corresponds to a <strong>note lifespan</strong>.\nIt is the minimum required for making our Synth.</p>\n<p>We will generally <strong>automate that amplitude through time for each note triggered</strong>.</p>\n<p>Here is a demo.\nPlay, try to hold and release a note (using the Play button or SPACE), and observe how the Spectrum Analyzer is moving:</p>\n<iframe width=\"100%\" height=\"400\" src=\"http://fiddle.jshell.net/tyEKr/32/show/light/\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\"></iframe>\n<a href=\"http://jsfiddle.net/tyEKr/32/\" target=\"_blank\" style=\"display: block; text-align: right\">Open on jsfiddle</a>\n\n<p><strong>Two different envelopes</strong> has been used: one for the <strong>Modulator</strong> and one for the <strong>Carrier</strong> which produce <strong>different sound effects in a note lifespan</strong>.</p>\n<p><em>We won&#39;t make an interactive demo for changing these envelope parameters,\nbut you can try them in the ZOUND project (or see again the video).</em></p>\n<h3 id=\"finetuning\">Finetuning</h3>\n<p>Another interesting effect occurs <strong>when the frequency of the Modulator is very close to the frequency of the Carrier</strong>.\nIn the following example, we have set both oscillators to the same frequency but we expose a &quot;detune&quot; parameter which allows to change a bit the frequency of the Modulator.</p>\n<iframe width=\"100%\" height=\"400\" src=\"http://fiddle.jshell.net/X95S6/10/show/light/\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\"></iframe>\n<a href=\"http://jsfiddle.net/X95S6/10/\" target=\"_blank\" style=\"display: block; text-align: right\">Open on jsfiddle</a>\n\n<p>You can slightly notice that a sound is regulary looping like if it was an LFO effect. You can also visualize it on the graph.</p>\n<p>This effect corresponds to the <strong><a href=\"http://tinyurl.com/nzkus8\">phase</a> change between both oscillators</strong>: it regulary change from <strong>&quot;in-phase&quot;</strong> state (where it have exactly the same sine waveform at the same time) to a desynchronize <strong>&quot;out-of-phase&quot;</strong> (because of the small detune), and then slightly go to the next &quot;in-phase&quot; step. More the frequencies are close, more it takes time to oscillate from phase to phase.</p>\n<p>This effect is especially awesome when you start mixing multiple synths together and finetune a bit each one so they don&#39;t sound exactly on the same frequency.</p>\n<h3 id=\"modulating-the-modulator\">Modulating the Modulator</h3>\n<p>There is so much more possibilites to play with,\nfor instance, the previously introduced Envelope could be mixed\nwith an LFO to change the Modulator effect in a rythm,\nbut now let&#39;s see how we can...</p>\n<p><strong>...modulate the modulator!</strong></p>\n<p>Eventually we can make a stack of modulators and use different kind of waveforms\nfor more powerful effects:</p>\n<p><img src=\"/images/2013/08/fm_multiple.png\" alt=\"\"></p>\n<blockquote>\n<p>Be careful when playing with stack of modulators, it is quite easy to have saturated or noisy sounds.</p>\n</blockquote>\n<p>As an example, I made this experiment which randomly takes different frequencies and amplitude for a stack of 5 modulators:</p>\n<p><a href=\"http://jsfiddle.net/s2MMR/45/\"><strong>-&gt; http://jsfiddle.net/s2MMR/45/ &lt;-</strong></a></p>\n<p>Careful! this experiment is a bit crazy! but it shows how different patterns can be when playing with FM.</p>\n<!-- TODO soon...\n## Last demo, polished FMs playing a famous song...\n\nAs a last demo example, and in a more readable & simple code, here is a polished example of FM.\n-->\n\n<hr>\n<p>Also, <strong>If you are interested by ZOUND live, <a href=\"http://github.com/gre/zound-live/\">fork it on Github</a>.</strong></p>\n","data":{"title":"Frequency Modulation (FM) with Web Audio API","description":"","author":"Gaetan","layout":"post","tags":["fm","audio"]}},"__N_SSG":true}