{"pageProps":{"id":"2021-08-29-plotting-pattern-03","year":"2021","month":"08","day":"29","slug":"plotting-pattern-03","content":"<ul>\n<li><a href=\"/2021/08/pattern-03\">Pre-release article</a></li>\n<li><a href=\"/2021/08/the-day-after-pattern-03\">Post article: Part 1: covering the rarity aspects</a></li>\n<li><a href=\"/2021/08/plotting-pattern-03\">Post article: Part 2: covering the future plots</a></li>\n</ul>\n<blockquote>\n<p>🤗 <strong>The ethblock.art BlockStyle <a href=\"https://ethblock.art/style/32\">&#39;Pattern 03&#39;</a> sold out yesterday in only 2 hours with 888 pieces.</strong> I still can&#39;t believe it. There are no words to describe how thankful I am for all your support. THANK YOU!</p>\n</blockquote>\n<h2 id=\"what-about-the-physical-art\">What about the physical art?</h2>\n<p>Quick recap of the philosophy announced before the BlockStyle was released:</p>\n<p><strong>Decoupling physical art from its digital form:</strong> Not all digital NFT collectors also are physical collectors. It is therefore important to allow both to co-exist without having a limitation on any side.</p>\n<p><strong>Openness and scalability of physical plotting</strong>. The digital NFT have a &quot;SVG&quot; button on hover which allow to download the SVG file (right click, download). The SVG format is a vectorial format that is used to define all the &quot;paths&quot; of drawing. It is the recipe to plots. That way, this is truly scalable and decentralized. Like blockchain is. I am not necessarily the only one that can plot the work physically. It could be you. It could be another artist. This model allows it.</p>\n<p><strong>An economy around the digital NFTs?</strong>  In this decoupled model, &#39;Pattern 03&#39; digital NFT are the main pivot NFTs at stake. an economy can be built around them. Physical artists can plot them, create &amp; sell on side collection that allows the second market to grow. There are many ways this can be traded: for instance swapping the digital NFT as a currency is a possibility that would be recommended, but so is doing a more regular &quot;selling print as a service&quot;... Ultimately, the physical artist value their own skills, own &quot;touch&quot; – a bit like a baker can sell baguettes with a shared recipe designed by ancestors.</p>\n<h2 id=\"greweb-pattern-03-plots-collection\"><em>&quot;@greweb &#39;Pattern 03&#39; plots&quot;</em> collection</h2>\n<p>A collection <a href=\"https://opensea.io/collection/greweb-pattern-03-plots\"><em>&quot;@greweb &#39;Pattern 03&#39; plots&quot;</em></a> has been created on OpenSea.\nIt will curate plots that I will start drawing in the coming days.</p>\n<p>It&#39;s going to be a time-consuming process as a plot takes about 1 hour to perform (depending on settings and complexity of the lines). The physical art is designed to be plotted with fountain pens on A4 water-colour 300g paper and then cut into a 21 by 21 centimeters piece with a 5mm padding (so your art is a 20x20cm square). The planned inks to use are those described by the &quot;Ink&quot; trait (Diamine inks). The digital NFT has simulated a rendering that will be relatively well respected. There is going to be unpredictability when plotting it for real.</p>\n<blockquote>\n<p>Disclaimer: Beware I will likely not be able to plot them all. There are 888 items and it takes an average 1 hour to plot. However, I&#39;ll start plotting following a bit this curation decision process:</p>\n<ul>\n<li>personal favorite picks</li>\n<li>I will look at Opensea most starred NFTs</li>\n<li>I will look at Opensea most sold NFTs</li>\n<li>also if you really want the physical piece. e.g. if you ask me on Discord / Twitter. I can sure take request and add it in the wished list But I can&#39;t guarantee it as it would probably takes me 800 hours =)</li>\n</ul>\n</blockquote>\n<h2 id=\"first-phase-🎉-claim-a-physical-plot-before-november-1st-2021\">First phase: 🎉 claim a physical plot <em>before November 1st, 2021</em></h2>\n<p>This first phase will ends on November 1st, 2021 for all physical NFTs. The presented offer will only be available during that time. The NFT physical I own after this time will still be owned by me and a second phase will be documented later.</p>\n<p><strong>How will it work?</strong></p>\n<p>You can claim a physical NFT (created on the collection shared above) <strong>as long as you own the digital NFT</strong>. </p>\n<p>To claim it, you make a small Offer on the NFT physical (pay what you want, e.g. 0.03 WETH) so I can verify you are the NFT digital owner &amp; proceed to the NFT transfer of that &#39;physical NFT&#39;.</p>\n<p>You will then get a code to obtain it physically.</p>\n<p><strong>How shipping works?</strong></p>\n<ul>\n<li>The &#39;physical NFT&#39;, once acquires, will have unlockable content with instructions on how to contact me for proceeding to shipping.</li>\n<li><strong>IMPORTANT: Please use a PO Box or other postal service ( e.g. <a href=\"https://en.wikipedia.org/wiki/Poste_restante\">https://en.wikipedia.org/wiki/Poste_restante</a> ). I do not want to know your home address, thanks.</strong></li>\n<li>On my side, I will use a simple (possibly tracked) letter to ship the 20x20cm art internationally.</li>\n</ul>\n<h2 id=\"second-phase\">second phase?</h2>\n<p><strong>This phase is not yet planned and may happen if people are interested to these plots.</strong></p>\n<p><img width=\"50%\" src=\"/images/2021/08/artist-1.jpg\" /><img width=\"50%\" src=\"/images/2021/08/artist-2.jpg\" /></p>\n","data":{"title":"The day after Pattern 03 (2/2)","thumbnail":"/images/2021/08/timelapse.gif","description":"The ethblock.art BlockStyle 'Pattern 03' sold out yesterday in only 2 hours with 888 pieces. Let's cover what's next with future plots.","tags":["NFT"]}},"__N_SSG":true}