{"pageProps":{"id":"2021-05-01-plot-loops","year":"2021","month":"05","day":"01","slug":"plot-loops","content":"<p>I am thrilled to release my first <strong>&quot;plot loop&quot;</strong> and plan to release one every week. Let me explain simply the idea:</p>\n<ul>\n<li>an animation is generated with code, (SVG plottable files)</li>\n<li>Each frame of this animation is plotted physically,</li>\n<li>photographed back into a digital picture,</li>\n<li>and post-processed back into a video that makes it an artistic creation by itself as well as each physical plot being one &quot;edition&quot; of that plot loop series.</li>\n</ul>\n<blockquote>\n<p><strong>You can see all my plot loops made so far at <a href=\"https://greweb.me/plots/tags/plotloop\">https://greweb.me/plots/tags/plotloop</a></strong></p>\n</blockquote>\n<p><strong>So there are two creations:</strong></p>\n<ul>\n<li>the animation is itself digital art =&gt; it is released as an NFT, with as many editions as there are frames.</li>\n<li>each individual frame is physical art =&gt; it can be shipped to first buyer.</li>\n</ul>\n<h3 id=\"plots-and-nft-\">Plots and NFT ?!</h3>\n<p><strong>Plot loop animations will be released as <a href=\"https://www.youtube.com/watch?v=Y-i9Jsm95ro\">Non Fungible Token (NFT)</a></strong> on <a href=\"https://www.hicetnunc.xyz/\">hicetnunc</a>. It allows anyone with Tezos crypto currency to acquire this video on Tezos blockchain. Digital collectors are collecting one edition of this NFT which adds to their collection: <strong>The NFT video is an art in itself</strong>. On top of this, physical collectors can also claim the shipping of the physical art of the frame corresponding to the collected NFT edition (there is as many editions as there are frames plotted).</p>\n<p><strong>This is a hybrid concept between physical and digital art.</strong> By buying a frame (by order of buy), the first buyer has the possibility to chose what happens to the physical art: either you allow me to keep it OR you can claim it (contact me on Twitter) and have me sending it anywhere in the world!</p>\n<blockquote>\n<p>I&#39;m writing a bigger article about my recent NFT exploration and my art in general. I&#39;ve been exploring so many ideas recently. I already sold some plots via NFTs, I am very honored to have found some buyers 😍. They can still be found at <a href=\"https://hic.link/greweb\">hic.link/greweb</a>. I&#39;m currently burning them one after the other to expire the possibility to buy them as I will focus on these new projects.</p>\n</blockquote>\n<h2 id=\"first-release-the-triplanet-loop\">First release, the triplanet loop</h2>\n<p><strong>hicetnunc NFT: <a href=\"https://www.hicetnunc.xyz/objkt/57902\">OBJKT#57902</a></strong></p>\n<p><a href=\"/plots/121\"><img width=\"50% \" src=\"/images/plots/121.gif\"/></a></p>\n<p>My first plot loop is called &quot;Triplanet&quot;. It&#39;s a transition of two parametric functions with many perlin noise displacements. This is a continuation of <a href=\"/plots/100\">&quot;Planet Holes&quot;</a> series as well as recent <a href=\"/plots/111\">&quot;Parametric stack&quot;</a> explorations.\nEvery frame is generated with a Rust script I wrote.</p>\n<p><strong>Triplanet was released in <a href=\"/plots/121\">plots#121</a>.</strong> 16 frames have been plotted with fountain pen on bristol paper (ink: Red Dragon by Diamine).</p>\n<img width=\"100%\" src=\"/images/plots/121_walled.jpg\"/>\n<img width=\"50%\" src=\"/images/plots/121_zoom.jpg\"/><img width=\"50%\" src=\"/images/plots/121_plot.jpg\"/>\n\n<p><strong>Plotting with fountain pen is challenging</strong> as it requires many search on the ink, paper and many fail and retry. Plotting all these frames took an afternoon.</p>\n<h2 id=\"whats-next\">What&#39;s next?</h2>\n<p>I plan to release a <em>plot loop</em> every week.</p>\n<p>It&#39;s taking a lot of time to plot all frames so there are great challenges: first of all is to reduce the number of frames, secondly is to make them worth it, to make them really good: I want every frame to be unique, to include some specific elements, easter eggs, that make it recognizable out of the other frames.</p>\n<hr>\n<h1 id=\"please-also-check-out-other-great-artists\">Please also check out other great artists</h1>\n<p>I believe a lot of this hybrid idea of mixing plot, animation, and NFTs. It was very funny for me to see all coïncidence and convergence of ideas on this topic. It&#39;s one of these moments when we have the same ideas at the same time. I&#39;m not the only one exploring this and I want to do a big kudos to these great artists.</p>\n<h3 id=\"marion-atelier_marion\">Marion <a href=\"https://twitter.com/atelier_marion/status/1388071908575490048\">@atelier_marion</a></h3>\n<p>who recently released a very similar idea! <del>She has 2 more frames yet to be taken!</del> Not anymore!</p>\n<p><a href=\"https://www.hicetnunc.xyz/objkt/42546\"><img src=\"https://cloudflare-ipfs.com/ipfs/QmXcAWQTaGHQp4BGy1krER284PoaPCNhKYzDrxp86MaM7b\" style=\"max-width: 300px\"></a></p>\n<p>She is also creating impressive drawing work as seen on her website: <a href=\"https://www.marionguy.com/shop\">https://www.marionguy.com/shop</a></p>\n<h3 id=\"maks-surguy-msurguy\">Maks Surguy <a href=\"https://twitter.com/msurguy\">@msurguy</a></h3>\n<p>who is behind <a href=\"https://plotterfiles.com/\">plotterfiles.com</a> platform. He also does a lot of great plotting art and thought about similar concept recently! <a href=\"https://medium.com/poptwig/artist-in-focus-maks-surguy-26277c95b197\">Checkout this article about his work.</a></p>\n<h3 id=\"thomas-lin-pedersen-thomasp85\">Thomas Lin Pedersen <a href=\"https://twitter.com/thomasp85\">@thomasp85</a></h3>\n<p>who is doing a <a href=\"https://www.hicetnunc.xyz/tz/tz2Pkj2xWJovKKCsABjnr3NbyMVJTMBkpTvb\">stuning work</a> and very impressive landscapes. Also selling NFT for shipping physical print.</p>\n<p>He recently did a very cool NFT in collaboration with <strong>Lionel Radisson</strong> <a href=\"https://twitter.com/MAKIO135\">@MAKIO135</a>:</p>\n<p><a href=\"https://www.hicetnunc.xyz/objkt/53662\"><video style=\"max-width: 300px\" controls autoplay loop src=\"https://ipfs.io/ipfs/QmaGfhSgWX1UTq6jPX11mfHDxccK5eXGYqi6u71zNLaBhY\"/></a></p>\n<h3 id=\"so-many-other-artists\">...so many other artists!</h3>\n<p>Let&#39;s chat! You can join us on <a href=\"https://discord.gg/jKNy6PynPK\">hicetnunc&#39;s discord</a> on channel #phygital-objkts which explore very similar idea and where other artists will be active!</p>\n<p>I&#39;m also available for collaboration.</p>\n","data":{"title":"'Plot loops' concept","thumbnail":"/images/plots/121.gif","description":"Releasing my first 'plot loop', generative animation plotted and published as an NFT.","tags":["plot","plotloop","NFT"]}},"__N_SSG":true}