{"pageProps":{"n":"116","plot":{"n":"116","key":"./116/README.md","rustFile":"116/main.rs","content":"<p><strong>Exploration of perlin noise triangle planets. various fountain pen on A4 bristol.</strong></p>\n<p>These are taking almost one hour to plot, with 2 passes of 2 different spirals. Each spiral varies a bit with different offset and displacement noise which creates a desired effect of bolder areas, caveats and craters.</p>\n<p>The displacement noise is a simple perlin noise, only one harmony is used but the noise is split into two 2 different perlin noises: the angle noise (like a vector field, different angle of displacement) and the amplitude noise (how much does the displacement move the point).</p>\n<p>The triangle is made with a parametric function, reusing technique explored on <a href=\"/plots/114\">plot#114</a>.\nThere is an important effort on finding a good balance between noise and distribution of lines (it&#39;s not linear, it&#39;s closer on edges).</p>\n","data":{"title":"Triangle planet","thumbnail":"/images/plots/116.jpg","description":"Exploration of perlin noise triangle planets. various fountain pen on A4 bristol.","tags":["parametric","perlin","planet"]}},"prev":{"n":"115","key":"./115/README.md","rustFile":"115/main.rs","content":"<p>This is a continuation of exploration started at <a href=\"/plots/112\">plot#112</a>.\nHad a great try of ink &quot;Amber&quot; by Diamine. Fountain pens on A4 bristol card.</p>\n","data":{"title":"Yellow fibers","thumbnail":"/images/plots/115.jpg","tags":["fibers"]}},"next":{"n":"117","key":"./117/README.md","rustFile":"117/main.rs","content":"<p>Another exploration of <a href=\"/plots/112\">plots#112</a>, more delicate than <a href=\"/plots/115\">plots#115</a>, with a centered noise of fibers. It uses two fountain pen inks for different color tones (Aurora Borealis and Writer&#39;s Blood from Diamine). I could try with even more lines in future but these are already almost 2 hours of plotting time! A4 on Bristol.</p>\n","data":{"title":"Noisy fibers","thumbnail":"/images/plots/117.jpg","description":"Exploration of fibers with a centered noise. two color tones.","tags":["fibers","perlin"]}}},"__N_SSG":true}