{"pageProps":{"n":"120","plot":{"n":"120","key":"./120/README.md","rustFile":"120/main.rs","content":"<p>This is a pretty simple technique, which is almost like a spiral filling, except it&#39;s a parametric (a simple one that is close to a spiral). The idea to render something monochrome with a parametric is interesting, I would like to dig more in future. I also tried it on typography (for a family gift).</p>\n<p>This plot is done with fountain pen and ink &quot;Amber&quot; by Diamine, which I really like.</p>\n<p>When you look closer, there are high frequency noise used to make it more fuzzy.</p>\n<img width=\"100%\" src=\"/images/plots/120_zoom.jpg\">\n","data":{"title":"Bitcoin","description":"a parametric spiral, similar to recent exploration, allows to fill the color of the Bitcoin logo","thumbnail":"/images/plots/120.jpg","tags":["bitcoin"]}},"prev":{"n":"119","key":"./119/README.md","rustFile":"119/main.rs","content":"<p>This is, like <a href=\"/plots/114\">plot#114</a>, yet another parametric &quot;stack&quot; (using parametric at different scales).\nThis time, the parametric is very noisy. There is a desired effect to make a blur illusion. It&#39;s very fuzzy. I have some glitches on the signature but it&#39;s part of the art now!</p>\n","data":{"title":"Blurry waves","description":"Yet another parametric stack, noisy one this time! white uniball on black A4.","thumbnail":"/images/plots/119.jpg","tags":["parametric"]}},"next":{"n":"121","key":"./121/README.md","rustFile":"121/main.rs","content":"<p><a href=\"/2021/05/plot-loops\"><strong>✍️ See also: Plot loops</strong> article</a>.</p>\n<p>This first plot loop is called &quot;Triplanet&quot;. It&#39;s a transition of two parametric functions with many perlin noise displacements. This is a continuation of <a href=\"/plots/100\">&quot;Planet Holes&quot;</a> series as well as recent <a href=\"/plots/111\">&quot;Parametric stack&quot;</a> explorations.\nEvery frame is generated with a Rust script I wrote.</p>\n<p>16 frames has been plotted with fountain pen on bristol paper (ink: Red Dragon by Diamine). With a back and forth effect, this produces a 30 frames animation loop.</p>\n<img width=\"100%\" src=\"/images/plots/121_walled.jpg\"/>\n\n<p><strong>The animation is released as a NFT video</strong> on <a href=\"https://www.hicetnunc.xyz/\">hicetnunc</a>. There are 16 editions, as many as there were frames plotted. The NFT video is an art in itself.</p>\n<p>By buying a frame (by order of buy), the first buyer also chose what happens to the physical plot: either I keep it OR you can claim it (contact me on Twitter) and have me sending it anywhere in the world!</p>\n<img width=\"100%\" src=\"/images/plots/121_zoom.jpg\"/>\n\n<p><strong>Plotting with fountain pen is challenging</strong> as it requires many search on the ink, paper and many fail and retry. Plotting all these frames took an afternoon.</p>\n<img width=\"100%\" src=\"/images/plots/121_plot.jpg\"/>\n\n<!--\n@greweb's #1 plot loop. 16 physical plots, fountain pen on A4 Bristol paper, one NFT edition for each plot frame. The 1920p video animation is the digital art that can be collected as-is. First buyer also chose what happens to the frame: can claim the physical art (PM @greweb, ship anywhere in world). See greweb.me/plots/121\ntags: animated, plot, plotloop, physical\n-->\n","data":{"title":"Triplanet (16 frames)","description":"Triplanet is my first plot loop, physical animation of 16 plotted frames. transition between parametric functions and perlin noise.","thumbnail":"/images/plots/121.gif","tags":["plotloop","parametric","perlin"],"objkts":[57902]}}},"__N_SSG":true}