{"pageProps":{"id":"2021-08-28-pattern-03","year":"2021","month":"08","day":"28","slug":"pattern-03","content":"<p>See follow-up articles:</p>\n<ul>\n<li><a href=\"/2021/08/the-day-after-pattern-03\">Post article: Part 1: covering the rarity aspects</a></li>\n<li><a href=\"/2021/08/plotting-pattern-03\">Post article: Part 2: covering the future plots</a></li>\n</ul>\n<p>🤗 <strong>The ethblock.art BlockStyle <a href=\"https://ethblock.art/style/32\">&#39;Pattern 03&#39;</a> was released on August 28th, 2021 and sold out in only 2 hours with 888 pieces.</strong></p>\n<p>Pattern 03 is a tribute to fountain pen plotting, generating strokes lines to yield unique patterns. It recreates the condition of ink on paper in a digital art form. The second market will be exciting as these are also physically plottable. A SVG file can be downloaded from each NFT that is the recipe for a physical artist to perform the art physically (20cm square), with their own tools.</p>\n<p>This article goes through many features of the generator and includes plotting tricks, technical notes, and useful information for collectors. You will see images attached, both digital and physical prototypes, at the end the rendering is very similar!</p>\n<p><img width=\"50%\" src=\"/images/2021/08/pattern-03-post.jpg\" /><img width=\"50%\" src=\"/images/blockstyles/pattern-03/01.png\" /></p>\n<p>For many months, I&#39;ve been exploring plotting art with fountain pens while exploring many different creative coding techniques. Every day, I&#39;ve been releasing generators and plotting art that you can find on <a href=\"https://greweb.me/plots\">https://greweb.me/plots</a>. This has been very interesting both technically and artistically. I expanded more and more my algorithm knowledge and creative coding techniques. These various experiences now contribute to this next level: I&#39;ve made a &quot;super generator&quot; that generalizes many of them into one bundled <em>ethblock.art</em> BlockStyle generator.</p>\n<p>Pattern 03 took a lot of patience and iterations to achieve its final result. I put my own expectation pretty high, I wanted great variety (and tweaking parameters is always hard). I also wanted a very realistic rendering technique that would almost look like the physical piece. The digital version had to be as good, if not better, than the possible physical piece that it could produce. I believe a lot in digital NFT by itself and the goal is to embrace digital-first.</p>\n<p>In the past months, I&#39;ve been thinking a lot about NFTs and the possibilities of physical VS digital art. I see many artists bridging the two worlds as well, there are many great experiments out there, I collected a bunch of physical art myself via NFTs. You already saw me already trying this <a href=\"/2021/05/plot-loops\">&quot;plot loops&quot;</a> concept.</p>\n<p><strong>By minting on the generator, you are generating digital art.</strong></p>\n<p>A lot of effort has been spent on the digital piece itself. It renders in a very realistic way on your browser, almost like if it was plotted, simulating many aspects of plotting. There is even a slight animation that I let you discover! The digital art is a unique 1:1 piece that will be an NFT that includes the SVG recipe:</p>\n<p> <strong>By minting on the generator, you are curating one recipe for a possible plot.</strong></p>\n<p>I&#39;ve been plotting many prototypes to tweak parameters in a way that everything should technically be drawn with fountain pens! By minting, you are curating a plottable art that an artist from the plotting community could use. I&#39;ve intentionally made it public and open for anyone to download the SVG related to a mint piece: ultimately anyone can plot it. This only unlocks the possibility and I will personally be one of this &quot;physical artist&quot; for the coming weeks. <strong>(see <em>NFT and physical pieces?</em> section for more information)</strong></p>\n<p><strong>By minting on the generator, you are a curator of the future plot collection.</strong></p>\n<p>Giving the possibility for curators to select plotted art out of a generator with fine controls to tweak it is beyond anything I&#39;ve seen done today in this field. In fine, minters have the responsibility to chose something really interesting that worth plotting, to express this responsibility, the fees to mint has been a bit higher than my previous BlockStyle.</p>\n<p> What I now want to achieve is to make the NFT as good &quot;digitally&quot; as it can be &quot;physically&quot;. I&#39;ve been plotting many prototypes to tweak parameters in a way that everything should technically be drawn with fountain pens! I want this art to be both physical and digital and in a loosely coupled way that gives full freedom of preferring one or the other or both.</p>\n<p> I intend later to offer a way for collectors to obtain the physical creation from me, but I believe this idea is beyond me and anyone in the plotting community could pick these to plot them. I believe a lot in free art, opensource and hacking mindset. I enjoy a lot free initiative like <a href=\"https://plotterfiles.com/\">plotterfiles.com</a> and this was a great inspiration here.</p>\n<h2 id=\"what-is-ethblockart\">What is EthBlock.art?</h2>\n<p>Before talking about &#39;Pattern 03&#39;, a quick recap of the platform I&#39;m releasing on:</p>\n<p>EthBlock.art aims to create a virtuous ecosystem of &quot;deterministic art&quot;, code visualization of Ethereum blocks. Everything is data: from the ethereum block of transactions, to the code that visualizes it, and to the NFTs minted/traded using Ethereum transactions (that themselves are into Ethereum blocks).</p>\n<p>This is a virtuous ecosystem, similar to <a href=\"https://en.wikipedia.org/wiki/Value_chain\">Supply Chain Transformation concepts</a>: each actor in this ecosystem add value and get retributed for it, as I tried to explain in this schema:</p>\n<p><img src=\"/images/posts/cryptoaliens/ethblockart.png\" alt=\"\"></p>\n<h2 id=\"the-controls\">The controls</h2>\n<p>As a minter, you get 6 &quot;mods&quot; controls.</p>\n<ul>\n<li><p><strong>MOD1:</strong> allows you to pick your color. which recreates the conditions of some inks. Black is very powerful but also other inks are very vivid.</p>\n</li>\n<li><p><strong>MOD2:</strong> is controlling two factors, the border width (0.5 to 1.0) and the intensity of the noise (cycles twice).</p>\n</li>\n<li><p><strong>MOD3:</strong> is a general padding control and also tweaks border placement and sometimes lines distance.</p>\n</li>\n<li><p><strong>MOD4:</strong> control the alignment of waves and the amplitude of the &quot;displacement&quot; effect.</p>\n</li>\n<li><p><strong>MOD5:</strong> controls the resolution of each line. (beware high values slows down other mods)</p>\n</li>\n<li><p><strong>MOD6:</strong> adds a variable blur effect.</p>\n</li>\n</ul>\n<blockquote>\n<p>MOD2 to MOD5 are controlling at least two properties of the art. This is something I like to call the &quot;duality of controls&quot;. When you make one slider controlling two properties, you are giving a lot of variety while &quot;constraining&quot; the boundaries of the possible tweaks, forcing the minter to look for other blocks. This also is very important for the UX of the controls. There is always a tradeoff between being fully in control and having to search another block.</p>\n</blockquote>\n<h2 id=\"rarity-features-block-data-and-what-drives-the-generation\">Rarity features, block data and what drives the generation</h2>\n<p>In JavaScript is implemented the logic to extract out the &quot;parameters&quot; of the generator from the block data. While some of the work relies on the block hash and use an RNG (fun fact: there are 70 calls to <code>random()</code> to make it very diverse in results and rarity), some of the work also are big data analysis on the block data.</p>\n<p>I&#39;m going to document here how some of the main features work, You can do a general Ethereum blocks analysis to find the shape you prefer!</p>\n<p>There are some other rarity features that I intentionally do not fully document. You do not need to &quot;hunt&quot; for the rarity that is &quot;designed by the author&quot;, but instead search for the organic rarity &amp; enjoy patterns and unexpected shapes.</p>\n<blockquote>\n<p>I crawled a lot of data from coingecko and etherscan to snapshot the prices of all ERC20 tokens in a way that I can value exactly how much a block have in $. I can then compare the Ethereum value and the ERC20 tokens value and do decisions based on it. (evaluated with Aug 2021 static prices)</p>\n</blockquote>\n<h3 id=\"main-shapes\">Main shapes</h3>\n<p>This most important feature split is the main shapes:</p>\n<ul>\n<li>If there is at least one transaction and mostly only Ethereum is transferred on that block (which is the case for very old blocks btw), you&#39;re going to get a <strong>&quot;rectangle spiral&quot;</strong>.</li>\n<li>If more $ is transferred in ETH than in ERC20 tokens, it&#39;s going to be <strong>vertical lines</strong>, <strong>horizontal otherwise</strong>.</li>\n<li>And finally, if there are actually exceptional amounts of ERC20 transfers (mostly only ERC20 transfers) it&#39;s going to Cross-Hatch.</li>\n</ul>\n<h3 id=\"lines-and-sub-lines\">lines and &quot;sub-lines&quot;</h3>\n<p><strong>First: The plots are all composed of N main lines.</strong></p>\n<p>The number of lines are driven by the number of transactions. More there are transactions in the minted art, more likely the number of lines will be high. This goes between 1 and 90 and these extremes are rare.</p>\n<p><strong>Second: each line subdivide into M &quot;sub-lines&quot;.</strong></p>\n<p>It is most visible when there are not a lot of &quot;lines&quot; as it will diverge so much that sublines are no longer touching:</p>\n<p><img src=\"/images/2021/08/turquoise-crosshatch.jpg\" alt=\"\"></p>\n<p>but it can also be subtle and not separate at all:</p>\n<p><img src=\"/images/2021/08/orange_lines.jpg\" alt=\"\"></p>\n<h3 id=\"f-main-driver-of-curves\"><code>f</code> main driver of curves</h3>\n<p>What I call <code>f</code> is a function that drives the sublines positioning and effectively makes them expanding or collapsing into one same line.</p>\n<p>It is implemented using various noises and combined with different techniques. The following plot is covering most of them:</p>\n<p><img src=\"/images/2021/08/pink-osc.jpg\" alt=\"\"></p>\n<ul>\n<li>the general noise effect is the most common feature here and is available 99% of the time (not having this noise is rare). It is built with Simplex Noise and domain warping.</li>\n<li>the circling is an added feature that is not very common. It can have various properties.</li>\n</ul>\n<p>There are also other cases like the fact lines would sometimes stop when the <code>f</code> values goes below 0.0.</p>\n<h3 id=\"displacement-second-driver-of-curves\"><code>displacement</code> second driver of curves</h3>\n<p>Displacement is a similar yet different technique. It allows displacing the whole lines independently of the <code>f</code> values. </p>\n<ul>\n<li>The waving effect seen in the pink image above is produced with simple trigonometry.</li>\n<li>It can aggressively make lines moving a lot, even &quot;looping&quot; sometimes.</li>\n</ul>\n<p>Displacement is overall a relatively rare feature. It is also one possible source of trouble for plotting (can dig the paper if you draw too much at the same place!) so it was pretty well contained.</p>\n<p>Here is an example of displacement with aggressive settings:</p>\n<p><img src=\"/images/2021/08/aggressive-displacement.jpeg\" alt=\"\"></p>\n<blockquote>\n<p>It looks like a photo but this is actually the digital version!</p>\n</blockquote>\n<h3 id=\"inks-and-colors\">Inks and colors</h3>\n<p>The curator-artist chose one color among 11 inks. Each ink has various properties and some are very vivid. I would overall recommend black which produces very good contrast plots, but it&#39;s great to have the general possibility.</p>\n<p><img src=\"/images/2021/08/inks.jpg\" alt=\"\"></p>\n<p>There are some plots that have color duality and that can also be plotted:</p>\n<p><img src=\"/images/2021/08/color-duality.jpg\" alt=\"\"></p>\n<blockquote>\n<p>This is a prototype and I was not careful as the corner and the final line scratch. Plotting is a challenge!</p>\n</blockquote>\n<h2 id=\"plot-optimizations\">Plot optimizations</h2>\n<p>A plotter is a machine that follows your drawing paths, here using SVG. When you do a SVG <code>&lt;path&gt;</code> every <code>move</code> (M) will be an actual move so you got to avoid useless moves. As it&#39;s easy to &quot;move to the start&quot; in algorithms, something that should not happen here.</p>\n<p>Sometimes, the pen also was going up where I planned to &quot;continue&quot;, this was the case of the initial algorithm of the &quot;rectangle spiral&quot;, I avoided doing moves and preferred to connect lines.</p>\n<p>To optimize the traveling of plotting lines, I&#39;ve made it go back and forth: The first line is drawn from left to right, the second line gets drawn from right to left, and so on... This allows to avoid too much undesired ink accumulation or other pen/paper issues by alternating the direction.</p>\n<p>Another problem I&#39;ve optimized is the order of plotting lines and sublines. Instead of plotting all sublines in once, I preferred to plot the first subline of each line, then the second subline of each line, and so on... Despite the small extra move it requires, it&#39;s very important to balance the ink evenly as some inks tend to &quot;dry&quot; a bit over time which makes the drawing &quot;fade away&quot; as it flows. What&#39;s interesting is you can see the fading happening on each line:</p>\n<p><img src=\"/images/2021/08/strokes-zoom.jpg\" alt=\"\"></p>\n<p>which is something I&#39;ve simulated on the digital piece too! The effect varies from one ink to another.</p>\n<blockquote>\n<p>See also how the ink behaves on this photo? accumulation of this ink produces red-ish colors. Something that can be observed on the digital generator as well!</p>\n</blockquote>\n<h2 id=\"technical-stack\">Technical stack</h2>\n<p>Technically speaking, I believe this is the best achievement I did in a few years and profoundly refreshing. I managed to connect my creative coding pipeline: Rust generating SVG files, used through WASM and post-processed in WebGL to add extra effects and simulate the ink drawing. This was a blast to put these all together and I feel I&#39;ve found something I&#39;ll keep doing in the next weeks and months.</p>\n<p>The choice to use Rust was initially a personal exploration, using a language that is meant to be performant while being relatively high level and functional. It&#39;s something I did initially for plots and it helped on time-consuming algorithm. I&#39;ve used it here for two reasons: first of all, most of my tooling for plotting is written in Rust, I&#39;m very fluent it in now and I have many helpers I could reuse, secondly, there is a gain of performance. I have initially written my code in JavaScript and had some bad performance on the simple templating of the SVG code, I&#39;ve estimated a gain of about x2 on the performance of using Rust. There are no super complex algorithms here, but it&#39;s still 2-3 loops with big iterations on them. The performance overall can still feel a bit slow, but you have to imagine each mod changes regenerate the SVG that can be up to 4 MB of XML.</p>\n<p>I didn&#39;t try to enable asynchronicity or parallelism but it&#39;s something I will dig in the future when I&#39;ll do more complex work like shape packing (that can require parallelization).</p>\n<p>This is a melting pot of technologies as I had to work on 3 aspects:</p>\n<ul>\n<li>In JavaScript is managed the logic that handles mods and block data and bakes the &quot;parameters&quot; of the generator.</li>\n<li>In Rust is implemented the generator itself, taking parameters in input and resulting SVG file.</li>\n<li>In WebGL/GLSL and gl-react library is implemented the simulation of ink on paper rendering.</li>\n</ul>\n<h2 id=\"nft-and-physical-pieces\">NFT and physical pieces?</h2>\n<p>The release of &quot;Pattern 03&quot; on EthBlock.art is primarily &quot;digital&quot; NFTs. Every BlockArt is going to be a digital NFT that includes the SVG recipe to make it physical.</p>\n<p><strong>The physical collection is not meant to be 1 physical for 1 digital</strong>. The idea is that the digital NFT remains unique but the physical art can be explored in different ways or ordered multiple times, it will not be guaranteed unique. Actually I can&#39;t prevent the plot to be done X times, like anyone can draw X times a La Joconde. However Nature have randomness and each physical plot will be unique.</p>\n<p><strong>This is by design decoupled.</strong></p>\n<ul>\n<li><p>There are curators that prefer digital art, this is the BlockArt. There are curators that may be interest by the physical version.</p>\n</li>\n<li><p>The &quot;physical artist&quot; do not necessarily need to be the same as the &quot;digital artist&quot;. The idea here is the art goes beyond me, the digital pieces are recipes and a community of plotters could be using these digital pieces in different ways under different terms and with their own tools. This is the openness of blockchain and NFT and this is secured by the contracts and the ownership of NFTs.</p>\n</li>\n</ul>\n<p><strong>What I plan personally to do &quot;as a physical artist&quot;</strong>. Now that this decoupling is explain, let me take the physical artist hat.\nAs physical plot have some cost, there are many ways to cover this. Indeed the simplest way is just to sell physical goods like a regular marchant.</p>\n<p>As I said before <em>Nature have randomness and each physical plot will be unique.</em>. As a physical plot is still unique, I will emit an NFT each time I plot something.</p>\n<p>In my case, there will be two ways of buying the physical piece:</p>\n<ul>\n<li>Either you will be able to SWAP your digital NFT against the physical NFT. And physical art will be shipped physically to where you want.</li>\n<li>Or you will be able to BUY it, but the price will be intentionally HIGHER than the digital NFT / will be following a bit the &quot;floor price&quot; of the digital NFTs of the collection.</li>\n</ul>\n<p>I will also be the one to chose what I plot, I will not necessarily &quot;plot them all&quot; (but I can take requests) and I will not necessarily keep a 1:1 relationship as shared before. Actually, if you chose the SWAP option, I will have back the NFT digital, this is the way I get &quot;paid&quot; as I can then put it back on market.</p>\n<p>I believe this ecosystem will be amazing and will allow a lot of options and freedom. I am so thrilled by the possibilities of NFT.</p>\n<p><img width=\"50%\" src=\"/images/2021/08/artist-1.jpg\" /><img width=\"50%\" src=\"/images/2021/08/artist-2.jpg\" /></p>\n","data":{"title":"Pattern 03, the first plottable generator on ethblock.art","thumbnail":"/images/2021/08/pattern-03-post.jpg","description":"Pattern 03 is a tribute to fountain pen plotting, generating strokes lines to yield unique patterns. It recreates the condition of ink on paper in a digital art form. The second market will be exciting as these are also physically plottable. A SVG file can be downloaded from each NFT that is the recipe for a physical artist to perform the art physically (20cm square), with their own tools.","tags":["NFT"]}},"__N_SSG":true}