{"pageProps":{"n":"342","plot":{"n":"342","key":"./342/README.md","rustFile":"342/main.rs","sourceURL":"https://github.com/gre/gre/blob/master/plots/examples/342/main.rs","content":"<p>This plot is the first of a series of 7 plots that reveal &quot;Plottable Circles&quot; – my next plottable generative art on <a href=\"https://fxhash.xyz/u/greweb\">fx(hash) platform</a>.</p>\n<p>This first plot reveals that my incoming generator is indeed going to be a reboot of <a href=\"https://greweb.me/plots/313\">https://greweb.me/plots/313</a> recent exploration. More properties will be revealed in the 6 next plots!</p>\n","data":{"title":"Circles (Reveal 1 / 7)","thumbnail":"/images/plots/342.jpg","description":"This plot is the first of a series of 7 plots that reveal 'Plottable Circles' – my next plottable generative art on fxhash","nftGenerator":"https://www.fxhash.xyz/u/greweb","tags":["plottable-circles"]}},"prev":{"n":"341","key":"./341/README.md","rustFile":"341/main.rs","sourceURL":"https://github.com/gre/gre/blob/master/plots/examples/341/main.rs","content":"<p>This plot is the genesis piece that covers my new Plottable Mesh generator.</p>\n<p>Many NFTs are available to mint with an interesting variety of results. As in <a href=\"/2021/12/plottable-mountain-moons\">previous generators</a>, owning the NFT confer the power to request a physical plot on: <a href=\"https://greweb.me/plots/nft\">https://greweb.me/plots/nft</a> – this is optional and you can also just enjoy the digital version.</p>\n<h2 id=\"artistic-direction-and-rare-aspects\">Artistic direction and rare aspects</h2>\n<p>The generator generalizes a bunch of past explorations you can find on <a href=\"https://greweb.me/plots\">https://greweb.me/plots</a></p>\n<p>A noise shape is mirrored to produce symmetry effect and, using marching square, transposed into lines. Lines are &quot;doubled&quot; to offer more depth in the pattern.</p>\n<p>The noise can be more or less intense, from a smooth mesh to stronger patterns.</p>\n<p>One of the important innovations is the &quot;intersection&quot; mecanism: lines of a shape stop when its &quot;mirrored&quot; version also stop, which makes areas without any lines and intensify the patterns. The intersection logic can diverge to allow a bit &quot;non intersected parts&quot;.</p>\n<p>One rarity aspect is the color you will get. It will sometimes be a 2-colors plot to emphasize on the mirror duality.</p>\n<p>There are many other rarity aspects and the general variety will offer a wide range of results.</p>\n<h2 id=\"the-density-technical-challenge\">The density technical challenge</h2>\n<p>As these are plottable, it was complex to adjust the number of lines depending on the intensity of the noise.</p>\n<p>I had some early failed prototypes caused by too many lines: the pen was literally digging into the paper! I have adjusted these to hopefully no longer happen.</p>\n<img src=\"/images/plots/341fail.jpg\" width=\"100%\"/>\n\n<h3 id=\"prototype-prototype-prototype\">Prototype Prototype Prototype</h3>\n<p>Like said in <a href=\"https://greweb.me/2021/12/plottable-mountain-moons\">https://greweb.me/2021/12/plottable-mountain-moons</a>, &quot;Prototype Prototype Prototype&quot; is the way to go for these physical pen/paper issues!</p>\n<p>The following photos are prototype plots that shows some different explorations but do not guarantee these will be possible outcomes, but it mostly could!</p>\n<img src=\"/images/plots/341b.jpg\" width=\"100%\"/>\n<img src=\"/images/plots/341c.jpg\" width=\"100%\"/>\n<img src=\"/images/plots/341d.jpg\" width=\"100%\"/>\n<img src=\"/images/plots/341e.jpg\" width=\"100%\"/>\n<img src=\"/images/plots/341f.jpg\" width=\"100%\"/>\n<img src=\"/images/plots/341g.jpg\" width=\"100%\"/>\n","data":{"title":"Plottable Mesh","thumbnail":"/images/plots/341.jpg","description":"This plot is the 'OG plot' that covers my new Plottable Mesh generator.","nftGenerator":"https://www.fxhash.xyz/u/greweb","tags":["plottable-mesh"]}},"next":null},"__N_SSG":true}