{"pageProps":{"n":"847","plot":{"n":"847","key":"./847/README.md","rustFile":"link","sourceURL":"https://github.com/gre/gre/tree/master/doodles/plottable-era-primitive","content":"","data":{"date":"2022-12-11","title":"Era (1) Primitive #341","image":"/images/plots/847.jpg","description":"Plot done for Plottable Era (1) Primitive generator","nft":"https://www.fxhash.xyz/gentk/998258","sourceFolderURL":"https://github.com/gre/gre/tree/master/doodles/plottable-era-primitive","tags":["era","era-primitive"]}},"prev":{"n":"846","key":"./846/README.md","rustFile":"link","sourceURL":"https://github.com/gre/gre/tree/master/doodles/plottable-era-primitive","content":"<p>plotted in 8 hours with a sakura gel pen (almost using the full capacity of the pen!)</p>\n","data":{"date":"2022-12-11","title":"Plottable Memories: Train Station #21","image":"/images/plots/846.jpg","description":"Plot done for Plottable Memories: Train Station generator","nft":"https://www.fxhash.xyz/gentk/1067464","sourceFolderURL":"https://github.com/gre/gre/tree/master/doodles/plottable-era-primitive","tags":["era","era-primitive"]}},"next":{"n":"848","key":"./848/README.md","rustFile":"848/main.rs","sourceURL":"https://github.com/gre/gre/blob/master/plots/examples/848/main.rs","content":"<p>Each individual plotted postcard were gifted to my colleagues at Ledger. I also plan to mint the resulting digital video on Objkt a bit later this week.</p>\n<h3 id=\"video-presentation\">Video presentation</h3>\n<iframe width=\"100%\" height=\"380\" src=\"https://www.youtube.com/embed/MHQLfXGRfBQ?rel=0\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\n<h3 id=\"artistic-direction\">Artistic direction</h3>\n<p>In the artwork &quot;Man and Machine,&quot; human figures are shown running up a mountain, accompanied by towering robots. This scene represents the relentless pursuit of progress and innovation, with humans constantly striving to push the boundaries of technology. The robots symbolize the power and potential of AI and robotics, both as a threat and as an opportunity. The mountain represents the challenges and obstacles that must be overcome in order to achieve this progress, and the fact that the humans are running alongside the robots shows the intertwined nature of the relationship between humans and technology.</p>\n<p>L&#39;oeuvre &quot;l&#39;homme et la machine&quot; explore la tension entre l&#39;homme et la technologie, en particulier l&#39;émergence des IA et des robots dans notre vie quotidienne.</p>\n<p>L&#39;oeuvre met en lumière les opportunités que cette technologie peut apporter, ainsi que les menaces qu&#39;elle peut représenter pour notre avenir.</p>\n<p>L&#39;oeuvre suggère que l&#39;homme est constamment en quête de progrès, qu&#39;il s&#39;agisse de bienfaits pour lui-même ou de dangers pour l&#39;humanité.</p>\n<p>L&#39;oeuvre peut être vue comme une métaphore de la course effrénée de l&#39;homme vers l&#39;avant, sans vraiment réfléchir aux conséquences de ses actions.</p>\n<p>L&#39;oeuvre peut également être interprétée comme une critique de la dépendance croissante de l&#39;homme à la technologie, et de la perte progressive de son humanité à mesure que les machines prennent de plus en plus de place dans nos vies.</p>\n<p><em>These explanations were generated by ChatGPT! The irony!</em></p>\n<h3 id=\"this-is-a-plot-loop\">This is a &quot;plot loop&quot;</h3>\n<p>This stop-motion animation is a <a href=\"/plots/tags/plotloop\">&quot;plot loop&quot;</a> made with 80 photos of postcard plots (A6).</p>\n<p>This was made with an AxiDraw plotter by batch of 4x2 grid of 10 A3 plots, then cut into 80 postcards. It took about 30 working hours to plot this (on just the plotting phase).</p>\n<p><em>This kind of exercise makes you understand how big the number &quot;80&quot; is. I can&#39;t imagine the gigantic work that Disney Studios had to do when drawing all their frames one by one. I feel lucky to live in 2022 with a plotter 🤗</em></p>\n<h3 id=\"this-is-actually-generative-entirely-made-with-code\">This is actually generative, entirely made with code</h3>\n<p>This animation looks to be made manually, but it&#39;s entirely generative: it is made from scratch with Rust code and the present output was curated among thousands of variants.</p>\n<p>I estimate to have been working more than 50 hours on this project. This work was based on some of my previous work, notably: <a href=\"/plots/832\">plots/832</a>, <a href=\"/plots/767\">plots/767</a>, <a href=\"/plots/509\">plots/509</a>.</p>\n","data":{"date":"2022-12-13","title":"L'Homme et la machine (80 frames)","image":"/images/plots/848.jpg","video":"/images/plots/848.mp4","tags":["plotloop"]}}},"__N_SSG":true}