{"pageProps":{"id":"2021-11-24-plottable-storm","year":"2021","month":"11","day":"24","slug":"plottable-storm","content":"<h2 id=\"the-plottable-nft-paradigm\">The &quot;Plottable NFT&quot; paradigm</h2>\n<p>I&#39;ve finalized what will be my paradigm for the next weeks and months:</p>\n<ul>\n<li>I will release a digital version of my work using NFTs and notably generative art NFT platforms.</li>\n<li>I will allow the NFT owners to request a physical plot on demand. (<a href=\"https://greweb.me/plots/nft\">https://greweb.me/plots/nft</a>)</li>\n</ul>\n<h3 id=\"a-collaborative-and-open-ecosystem\">A collaborative and open ecosystem</h3>\n<p>The NFT, like any regular NFT, points to a digital artwork that can be sold and resold on second market – blockchain guarantees its unicity.</p>\n<p>In the &quot;Plottable NFT&quot;, such <strong>NFT gives a privilege to its owner: requesting a physical plot</strong> (with an artistic fee to cover costs, <a href=\"https://greweb.me/plots/nft\">see /plots/nft</a>). This obviously can be executed multiple times, yet every physical piece is unique: plotting is an analog process that will inevitably yield different results.</p>\n<p><a href=\"https://greweb.me/plots/nft\">https://greweb.me/plots/nft</a> sets my own &quot;plotting services&quot; terms but any other plotter artist is welcome to collaborate and contribute to offering to the community their own services under their own terms and interpretation of the art – I would just ask to verify that the requester owns the NFT.</p>\n<img width=\"100%\" src=\"/images/2021/11/plottablestorm/schema.png\">\n\n<p>The NFT vs physical art decoupling allows a business model that allows both the digital creator and the physical creator to be rewarded and makes the NFT truly interesting as a token that has a real-life action: to unlock physical pieces.</p>\n<blockquote>\n<p>You can be your own artist too, buy a plotter, try it out! This is all designed to be open-source friendly and you can download the SVG yourself!</p>\n</blockquote>\n<h2 id=\"grewebs-generative-art-plotting-and-nfts\">@greweb&#39;s generative art, plotting and NFTs</h2>\n<h3 id=\"releasing-plottable-storm-on-fxhashxyz\">RELEASING &quot;Plottable Storm&quot; on fxhash.xyz</h3>\n<p><a href=\"https://www.fxhash.xyz/u/greweb\"><strong>=&gt; Check my profile on fxhash.xyz &lt;=</strong></a></p>\n<p><strong>Here is one digital ink simulated version: (this is not a photo!)</strong></p>\n<img width=\"100%\" src=\"/images/2021/11/plottablestorm/digital.jpg\">\n\n<p><strong>Here is the physically plotted version: (photo of the 3 hours long plot on A4 paper)</strong></p>\n<img width=\"100%\" src=\"/images/2021/11/plottablestorm/physical.jpg\">\n\n\n<p>This work is based on one of my original exploration: <a href=\"https://greweb.me/plots/312\">https://greweb.me/plots/312</a>.</p>\n<blockquote>\n<p>Plottable Storm is a flow field simulating fountain pen ink drawing on paper on its digital form. 10 inks, many rarity features varying noise, size and color positionning. Having only one color is rare.\nThe digital NFTs can be used to perform a physical action: @greweb plotting on demand a fountain pen plot for those who also want physical originals.</p>\n<p>Digital and Physical art, hybrid and decoupled:</p>\n<ul>\n<li>The art is made as a regular digital NFT on Tezos blockchain – its digital form rendered with WebGL shaders.</li>\n<li>Token to the physical world: owning each NFT confer the power to request the related physical plot.</li>\n</ul>\n<p>A collaborative and open ecosystem: an SVG file can be downloaded (Drag&amp;Drop or right-click save) and plotted with fountain pens physically by plotter artists who can interpret it the way they want in their own conditions. @greweb offers his service on <a href=\"https://greweb.me/plots/nft\">https://greweb.me/plots/nft</a></p>\n<p>Designed for A4 size. Estimated time of 3 hours of plotting time (25% speed)</p>\n</blockquote>\n<p><strong>Here are a few other physical plots made during the exploration</strong>, especially important to tweak the generator to make a plot that would be feasible without damaging the paper too much!</p>\n<img width=\"100%\" src=\"/images/2021/11/plottablestorm/2.jpg\">\n<img width=\"100%\" src=\"/images/2021/11/plottablestorm/3.jpg\">\n<img width=\"100%\" src=\"/images/2021/11/plottablestorm/4.jpg\">\n\n<h3 id=\"coming-from-past-explorations\">Coming from past explorations</h3>\n<p>This latest work is a continuation of a lot of previous explorations. In the past months, I&#39;ve been continuously exploring different ways to combine physical art with digital NFT and one of the recent way I&#39;ve been trying this is <a href=\"/2021/08/pattern-03\">&quot;Pattern 03&quot; (article)</a>.</p>\n<p>I&#39;ve been polishing my ink simulator lately and based on the same principle I will be able to generate more plots and have easy ways to iterate on. The tech stack is a bit ambitious, experimental and unique:</p>\n<ul>\n<li>The SVG generator is implemented in Rust language and then compiled and executed in WASM on the browser.</li>\n<li>It is rendered in real time and enhanced with WebGL shaders.</li>\n</ul>\n<p>In context of <a href=\"https://etherscan.io/gastracker\">Ethereum absured fees</a>, I&#39;ve decided to focus my NFT effort on other blockchains like Tezos. I&#39;m also focusing even more on my &quot;plottable art&quot; lately because, even if it&#39;s maybe not where I find the most sucess, it is definitely what I love the most experimenting with. There are so much challenge to tackle with the physical ink and paper constraints.</p>\n<h3 id=\"future-plans\">Future plans</h3>\n<p>This year, I&#39;ve been releasing a plot a day as shown on <a href=\"https://greweb.me/plots\">https://greweb.me/plots</a> and I intend to continue to do so, but in a more organized way:</p>\n<p><strong>On the next weeks, and on a weekly basis,</strong> I intend to release a new plottable NFT generator on fxhash. &quot;Plottable Storm&quot; is hopefully the series of many! I will adapt some of my best plotting explorations of this year but I also plan to dedicate time on exploring new ideas.</p>\n<p><strong>Starting next year, on a monthly basis,</strong> I intend to have a &quot;subscribe to my plots&quot; series where people would receive surprise plots in their mailbox from me and using a NFT membership system. The idea is still a work in progress – <strong>Would you be interested in this idea? Don&#39;t hesitate to keep in touch with me if you like this concept.</strong></p>\n","data":{"title":"“Plottable Storm”, a generator of plottable SVGs","thumbnail":"/images/2021/11/plottablestorm/digital.jpg","description":"I will release a digital version of my work using NFTs and notably generative art NFT platforms. I will allow the NFT owners to request a physical plot on demand.","tags":["NFT","plot"]}},"__N_SSG":true}