{"pageProps":{"id":"2021-04-08-cryptoaliens","year":"2021","month":"04","day":"08","slug":"cryptoaliens","content":"<blockquote>\n<p>See also <a href=\"/2021/04/cryptoaliens-tech\">CryptoAliens: Genesis, a technical look</a>.</p>\n</blockquote>\n<p><img src=\"/images/posts/cryptoaliens/021_px.png\" width=\"50%\" /><img src=\"/images/posts/cryptoaliens/001_px.png\" width=\"50%\" /></p>\n<blockquote>\n<p>CryptoAliens: Genesis establishes the first embryonic species. Which CryptoAliens are you going to chose? Each creature gets born on an Ethereum block that nourishes its shape: transactions, ETH value transferred, gas,... their unique skin comes from Mandelglitch&#39;s BlockStyle with the same rarity scheme.</p>\n</blockquote>\n<h2 id=\"what-are-cryptoaliens\">What are CryptoAliens?</h2>\n<p>CryptoAliens are digital creatures generated from Ethereum blockchain blocks. They can be minted on <a href=\"https://ethblock.art/create/24\">ethblock.art</a> by anyone, to establishes a limited set of CryptoAliens species in a decentralized matter. Each block produced on Ethereum have unique elements that can be visualized in creative ways.</p>\n<p><img src=\"/images/posts/cryptoaliens/014_px.png\" width=\"50%\" /><img src=\"/images/posts/cryptoaliens/017_px.png\" width=\"50%\" /></p>\n<blockquote>\n<p><strong>CryptoAliens are born and nourished from transactions, transactions are bones, ETH is flesh,... and many other aspects that this article will explain!</strong></p>\n</blockquote>\n<p><img src=\"/images/posts/cryptoaliens/032_px.png\" width=\"50%\" /><img src=\"/images/posts/cryptoaliens/013_px.png\" width=\"50%\" /></p>\n<h3 id=\"so-i-decide-which-ones-are-the-cryptoaliens\">So I decide which ones are the CryptoAliens?</h3>\n<p><strong>Yes! As a NFT minter, you are the creator and you contribute at establishing the first &#39;Genesis&#39; series of CryptoAliens.</strong> You decide which creature deserve to live. You are the curator and it is your responsible to do a lot of research and find the most adorable (or the creepiest?) creature!</p>\n<p><img src=\"/images/posts/cryptoaliens/036_px.png\" width=\"50%\" /><img src=\"/images/posts/cryptoaliens/004_px.png\" width=\"50%\" /></p>\n<h3 id=\"how-many-cryptoaliens-are-there\">How many CryptoAliens are there?</h3>\n<p>Every single CryptoAliens species is unique and there are currently 12 millions because that&#39;s as many blocks there are today (April 2021). Every 15 seconds, a new block is minted on Ethereum blockchain (with usually hundreds of transactions in it) making a new CryptoAliens possibility.\nThe block is the DNA, but the creature only starts existing when minted!</p>\n<p><strong>TLDR. CryptoAliens only comes to life when someone mint it as an NFT on the <a href=\"https://ethblock.art/create/24\">ethblock.art</a> contract.</strong> They can then be sold and traded on <a href=\"https://opensea.io\">opensea.io</a>. There is <strong>a limited amount of CryptoAliens possible to mint</strong> so be wise at your choice. In this &#39;Genesis&#39; series, the current supply is set to 100!</p>\n<p><img src=\"/images/posts/cryptoaliens/002_px.png\" width=\"50%\" /><img src=\"/images/posts/cryptoaliens/003_px.png\" width=\"50%\" /></p>\n<h3 id=\"what-is-genesis-series-about\">What is &#39;Genesis&#39; series about?</h3>\n<p>The idea of &#39;Genesis&#39; is that we are collectively going to create the initial species of this universe (with the NFT we chose to mint).</p>\n<p>Minting a <em>CryptoAliens: Genesis</em> specimen is giving birth to the creature, therefore the current NFT is visualized on <a href=\"https://ethblock.art/create/24\">ethblock.art</a> as a video tape recording of that time of birth (with the block number, time, weight and number of bones). These data are included in the NFT itself and could be reused in future!</p>\n<h2 id=\"what-determines-how-a-cryptoaliens-specimen-looks-like\">What determines how a CryptoAliens specimen looks like?</h2>\n<p>There are many information contains in Ethereum blocks that will get used to determine the general shape and gives its rarity.</p>\n<h3 id=\"blocks-timestamp\">Block&#39;s timestamp</h3>\n<p><img src=\"/images/posts/cryptoaliens/040_px.png\" width=\"50%\" /><img src=\"/images/posts/cryptoaliens/041_px.png\" width=\"50%\" /></p>\n<p>When the block happened during UTC night, the visual will be in dark mode.</p>\n<h3 id=\"blocks-transactions-amount\">Block&#39;s transactions amount</h3>\n<p><img src=\"/images/posts/cryptoaliens/007_px.png\" width=\"50%\" /><img src=\"/images/posts/cryptoaliens/008_px.png\" width=\"50%\" /></p>\n<p>When a block contains a lot of transactions it will impact its general weight. It will be highlighted by this very heavy blobs shapes. That said, the weight can be more or less dense based on amount of bones and also unique for each CryptoAliens specimen.</p>\n<h3 id=\"blocks-heavy-transfers-in-eth\">Block&#39;s heavy transfers in ETH</h3>\n<p><img src=\"/images/posts/cryptoaliens/035_px.png\" width=\"50%\" /><img src=\"/images/posts/cryptoaliens/020_px.png\" width=\"50%\" /></p>\n<p>As said in the introduction, &quot;ETH is flesh&quot;. Even tho most of the time it will impact the general weight of the creature, when a block contains an expectionally high transfer of Ethereum value, it will be highlighted by a big &quot;head&quot; on the creature. (&quot;head&quot; in doublequote because none of our scientist really figured what is this)</p>\n<h3 id=\"blocks-exceptionally-low-amount-of-eth-transferred\">Block&#39;s exceptionally low amount of ETH transferred</h3>\n<p><img src=\"/images/posts/cryptoaliens/005_px.png\" width=\"50%\" /><img src=\"/images/posts/cryptoaliens/006_px.png\" width=\"50%\" /></p>\n<p>On the contrary, when a block contains almost no ETH transfers, the arms will be very thin. Clearly ETH traders didn&#39;t nourish enough this poor creature.</p>\n<h3 id=\"blocks-important-ratio-of-gas-used-vs-eth-value-transfer\">Block&#39;s important ratio of gas used (vs ETH value transfer)</h3>\n<p><img src=\"/images/posts/cryptoaliens/023_px.png\" width=\"50%\" /><img src=\"/images/posts/cryptoaliens/016_px.png\" width=\"50%\" /></p>\n<p>It often appears in combination with the previous criteria, if the ratio <code>total gas / total eth transfers</code> is high, meaning that a lot of the ETH is into gas, there will be some blobs at the end of the arms.</p>\n<h3 id=\"and-more-block-rare-features\">...and more block rare features</h3>\n<p>There are a lot of special cases are rare conditions that can happen. I will not disclose and I will let you discover. Some are really rare and some will be discovered in the future (even the author of blockstyle won&#39;t be aware of all cases!).</p>\n<h3 id=\"blocks-hash\">Block&#39;s hash</h3>\n<p>Finally, the block hash gives variety in the results. It&#39;s necessary in order to have truly unique 12 millions species. But it&#39;s only complementary to the various other criteria. There are many features that are getting impacted by it, including the skin texturing (see <em>Mandelglitch BlockStyle</em> section).</p>\n<p><img src=\"/images/posts/cryptoaliens/043_px.png\" width=\"50%\" /><img src=\"/images/posts/cryptoaliens/042_px.png\" width=\"50%\" />\n<img src=\"/images/posts/cryptoaliens/012_px.png\" width=\"50%\" /><img src=\"/images/posts/cryptoaliens/038_px.png\" width=\"50%\" /></p>\n<h3 id=\"what-controls-does-the-creator-have\">What controls does the creator have?</h3>\n<p>At creation time, the minter also have the ability to move a bit the specimen:</p>\n<ul>\n<li><code>mod1</code> is a simple rotation around it.</li>\n<li><code>mod2</code> is a simple climbing and zooming.</li>\n<li><code>mod3</code> will flex a bit the shape to make it torn &amp; twist a bit.</li>\n<li><code>mod4</code> have an impact on the color palette scaling.</li>\n</ul>\n<p><strong>On top of this, mods have the ability to transform the skin texturing</strong> which is actually based on <a href=\"https://ethblock.art/create/17\">Mandelglitch BlockStyle</a>! That means the rarity elements of Mandelglitch are shared in this new BlockStyle.</p>\n<h3 id=\"mmh-mandelglitch-blockstyle\">mmh, Mandelglitch BlockStyle?</h3>\n<p><a href=\"https://ethblock.art/create/17\"><img src=\"/images/posts/cryptoaliens/mandelglitch.png\" width=\"10%\" /></a> <strong><a href=\"https://ethblock.art/create/17\">Mandelglitch</a> is a BlockStyle on <a href=\"https://ethblock.art/create/17\">ethblock.art</a>, derived from Mandelbrot fractal.</strong></p>\n<p>The visibility of Mandelglitch on the skin has been intentionally contained, but sometimes it is more visible. Here are two examples:</p>\n<p><img src=\"/images/posts/cryptoaliens/031_px.png\" width=\"50%\" /><img src=\"/images/posts/cryptoaliens/022_px.png\" width=\"50%\" /></p>\n<h2 id=\"and-whats-next\">...and, What&#39;s next?</h2>\n<p>Who knows what&#39;s next! As everything is available on the blockchain, what you mint is saved immutably and forever. Me or other artists could fork the code (<a href=\"https://github.com/gre/gre/tree/master/blockarts/CryptoAliens\">available on Github</a>) to make animated version of the CryptoAliens that were chosen (as this code is open source). Also we can imagine doing crossover between species or doing &quot;evolution&quot; of these species over time. Everything is possible!</p>\n<hr>\n<p>See also <a href=\"/2021/04/cryptoaliens-tech\">CryptoAliens: Genesis, a technical look</a>.</p>\n<p>My name is Gaëtan Renaudeau, and I&#39;m a noise explorer. <strong>feel free to ping me on Twitter <a href=\"https://twitter.com/greweb\">@greweb</a></strong></p>\n","data":{"title":"CryptoAliens: Genesis [ethblock.art]","thumbnail":"/images/blockstyles/24.png","description":"CryptoAliens are digital creatures generated from Ethereum blockchain blocks. They can be minted on ethblock.at by anyone, which establishes a limited set of CryptoAliens species. Each block produced on Ethereum have unique elements that can be visualized in creative ways.","tags":["NFT","shaders"]}},"__N_SSG":true}