{"pageProps":{"n":"1078","plot":{"n":"1078","key":"./1078/README.md","rustFile":"1078/main.rs","sourceURL":"https://github.com/gre/gre/blob/master/plots/examples/1078/main.rs","content":"<p>This is a pen plotted interpretation of this shader work by \n<a href=\"https://twitter.com/naibdian\">@naibdian</a>. Fire and Ice ink was so unpredictable and capricious and this goes even more into abstract art. A4 square.</p>\n","data":{"date":"2023-04-23","title":"Soul Vortex #15","image":"/images/plots/1078.jpg","nft":"https://www.fxhash.xyz/gentk/FX1-23066"}},"prev":{"n":"1077","key":"./1077/README.md","rustFile":"1077/main.rs","sourceURL":"https://github.com/gre/gre/blob/master/plots/examples/1077/main.rs","content":"<p>A3 plot made with Sakura Gelly Roll 08 on Fabriano Black Black paper.</p>\n<iframe width=\"100%\" height=\"400\" src=\"https://www.youtube.com/embed/R9YkJkhFEns\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\n<p>For &quot;Lunar&quot; theme of @sableraph&#39;s #wccchallenge of this week, I decided to revisit some minimalistic ideas: the recursive circles packing that I explored 2 years ago in <a href=\"/plots/203\">plots/203</a>.</p>\n<p>Except this time, we would fill circle with spirals instead of drawing just the outline. I initially thought about only rendering spirals for the leaf cases of the recursion but after accidentally enabling the effect for all, I found it even more interesting to go into this moiré effect and the spiral density accumulation. The recursion have 10% chance to stop at each level, as well as a spiral have 10% change to only render a simple circle, to let the background shine through.</p>\n<p><strong>The beauty of plotting is that, even though the idea and the digital version is relatively simple, the physical execution have a lot of random factors that can make each plot really unique.</strong> In the present case, I had random line failures as well as pen not lifting up properly in other cases.</p>\n<img src=\"/images/plots/1077z.jpg\" width=\"100%\" />","data":{"date":"2023-04-20","title":"Lunar","image":"/images/plots/1077.jpg","frDescription":"création issue d'un générateur basé sur un algorithme récursive, qui pave l'espace de cercles. chaque cercle est dessiné avec une spirale. Cette création est le résultat d'un processus aléatoire, rendu physique au stylo gel blanc sur le plotter. Malgré la simplicité de l'idée, le rendu démontre une grande complexité dans les choix qui sont possibles et les intersections créé entre les différents niveaux de spirales.","tags":["lunar"]}},"next":{"n":"1079","key":"./1079/README.md","rustFile":"link","sourceURL":"https://github.com/gre/gre/tree/master/doodles/plottable-golden-train","content":"<p>This plot is one physical counterpart delivered to the digital owner of &#39;Plottable Golden Train #111&#39;. \nPlottable Golden Train includes many variations (bridges, cactus, clouds, eagles, colors,...) entirely generated with code at mint (generative art).</p>\n","data":{"date":"2023-04-24","title":"Golden Train #111","image":"/images/plots/1079.jpg","sourceFolderURL":"https://github.com/gre/gre/tree/master/doodles/plottable-golden-train","sourceFolder":"plottable-golden-train","nft":"https://publicworks.art/work/plottable-golden-train/111","tags":["golden-train","A6"]}}},"__N_SSG":true}