{"pageProps":{"id":"2012-08-01-zound-a-playframework-2-audio-streaming-experiment-using-iteratees","year":"2012","month":"08","day":"01","slug":"zound-a-playframework-2-audio-streaming-experiment-using-iteratees","content":"<p><img src=\"/images/2012/07/ZOUND.png\" alt=\"ZOUND\"></p>\n<p>Last Friday was HackDay #7 at <a href=\"http://zenexity.com\">Zenexity</a>, and we decided to work on a real-time audio <a href=\"http://github.com/gre/zound\">experiment</a> made with <a href=\"http://playframework.org\">Play Framework</a>. The plan was to use an audio generator (<a href=\"http://www.softsynth.com/jsyn/\">JSyn</a>, an audio synthesizer), encode the output and stream it all using Play Iteratees to pipe everything in real-time.</p>\n<iframe width=\"640\" height=\"360\" src=\"http://www.youtube.com/embed/taDLKTcNHnQ?feature=player_embedded\" frameborder=\"0\" allowfullscreen></iframe>\n\n<p><strong>First of all, let’s highlight some interesting part of the project, then get into some of the details.</strong></p>\n<p>Thanks to <a href=\"https://twitter.com/Sadache\">@Sadache</a> for his Iteratee expertise, we ended up with a simple line of code that does all of the hard work:</p>\n<pre><code class=\"language-scala\">val chunkedAudioStream = rawStream &amp;&gt; chunker &amp;&gt; audioEncoder\n</code></pre>\n<p>You can think of the <code>&amp;&gt;</code> operator as the UNIX pipe <code>|</code>. So we simply take the <code>rawStream</code>, chunk it with a <code>chunker</code> and encode it with an <code>audioEncoder</code>.</p>\n<p>Now, <strong>rawStream</strong> is the raw stream of audio samples (numbers between -1 and 1) generated by the audio synthesizer. Next, the <strong>chunker</strong> buffers a data stream into chunk of bytes. For instance, if you send data stream at 1Kb/s to a 10Kb chunker, it will output one chunk of size 10Kb every 10 seconds. And finally, the <strong>audioEncoder</strong> takes <strong>audio samples</strong> and outputs encoded bytes implementing an audio format (like WAVE).</p>\n<p>We can then make a broadcast of the stream:</p>\n<pre><code class=\"language-scala\">val (sharedChunkedAudioStream, _) =   \n  Concurrent.broadcast(chunkedAudioStream)\n</code></pre>\n<p>And then the <strong>sharedChunkedAudioStream</strong> is now a shared stream for every consumer (clients). All that’s left to do is to stream it over HTTP:</p>\n<pre><code class=\"language-scala\">def stream = Action {  \n  Ok.stream(audioHeader &gt;&gt;&gt; sharedChunkedAudioStream).  \n     withHeaders( (&quot;Content-Type&quot;, audio.contentType) )  \n}\n</code></pre>\n<p>The <code>&gt;&gt;&gt;</code> operator means “concatenation”, so here we’re concatenating the <strong>audio header</strong> (given by the format like WAVE) with the current <strong>chunked audio stream</strong>. We also send the right HTTP <strong>Content-Type</strong> header (like “audio/wav” for WAVE).</p>\n<p>Another interesting part of the project is the <strong>multi-user web user interface: allowing users to interact with the sound synthesis</strong>.</p>\n<p>Using <a href=\"https://twitter.com/mrspeaker\">@mrspeaker</a>‘s audio synthesis expertise, we started creating a synthesizer generator – 3 oscillators, various wave shapes, frequency and volumes, and finally flowing through a high pass filter before entering our “rawStream” above.</p>\n<p>Thanks to the Play framework goodness, <strong>this audio stream can be both consumed by the web page with an HTML audio tag, and with a stream player such as VLC!</strong> Ok, that’s the project – let’s have a closer look at some of the concepts…</p>\n<!--more-->\n\n\n<h2 id=\"what-is-sound\">What is sound?</h2>\n<blockquote>\n<p>Sound is a mechanical wave that is an oscillation of pressure transmitted through a solid, liquid, or gas, composed of frequencies within the range of hearing and of a level sufficiently strong to be heard, or the sensation stimulated in organs of hearing by such vibrations. <em><strong>Wikipedia</strong></em></p>\n</blockquote>\n<p>We can represents the sound like any wave as a graphic of the amplitude (the oscillation pressure) as a function of time. Here you see it in Audacity:</p>\n<p><img src=\"/images/2012/07/sound-audacity.png\" alt=\"sound-audacity\"></p>\n<p>Electricity is used to pump these amplitudes to your speakers, over time.</p>\n<h3 id=\"about-primitive-wave-sounds\">About primitive wave sounds</h3>\n<p>There are some patterns – some primitives waves – we can easily generate with computers (or before with analog oscillators). Those are well known by mathematicians and physicians: Sine wave, Triangle wave, Square wave,…</p>\n<p><a href=\"http://en.wikipedia.org/wiki/File:Waveforms.svg\"><img src=\"/images/2012/07/557px-Waveforms.svg_.png\" alt=\"\"></a></p>\n<p>A sine wave produce a smooth tone, whereas Triangle and Square wave are more aggressive sounds. The shorter a wave period is, the lower the note you hear: it’s called the frequency.</p>\n<h3 id=\"how-is-sound-represented-by-computer\">How is sound represented by computer?</h3>\n<p>Whereas analog oscillators generate sounds in an <em>almost*</em> continuous stream of electricity, computers are not able to generate continuous stream of data. This is why with computers the sound is divided in to discrete <strong>samples</strong>, usually <strong>44100 samples per second</strong> for standard CD quality audio. Each sample is a value (amplitude) for a given time position.</p>\n<p><a href=\"http://en.wikipedia.org/wiki/File:Waveforms.svg\">See Sampling (wikipedia)</a>.</p>\n<p>If you zoom in Audacity, you can actually see each sample:<br><img src=\"/images/2012/07/audacity-zoom-ah.png\" alt=\"audacity-zoom\">\nThis is an “AH” timbre of my voice. A timbre is unique to everyone, it’s the pattern the sound wave take when you speak. <strong>The amplitude of an audio sample is usually represented as a Real number between -1.0 and 1.0</strong>.</p>\n<p>** electricity is not strictly continuous, we have electrons out there!*</p>\n<p>Ok, Let’s go back to our experiment now!</p>\n<h2 id=\"the-experiment\">The experiment</h2>\n<p>Our experiment is using <a href=\"http://www.playframework.org/\">Play Framework</a> and is written in <a href=\"scala-lang.org/\">Scala language</a>. Specifically, our project takes advantage of Play framework’s powerful <strong>Iteratee</strong>s.</p>\n<blockquote>\n<p>Take the expressivity of UNIX pipes, bring the power of Scala, mix it with Play Framework and you got a powerful framework for handling real-time and web streaming.</p>\n</blockquote>\n<p>The iteratee (and related constructs) can take a bit of getting used to. I recommend checking out <a href=\"http://sadache.tumblr.com/post/26784721867/is-socket-push-bytes-all-what-you-need-to-program\">this article on Iteratees in Play</a> and/or <a href=\"http://www.infoq.com/presentations/Play-I-ll-See-Your-Async-and-Raise-You-Reactive\">this presentation</a> if you are interested in learning more about Play2 and reactive programming with Iteratees. And if you just want to see how it work – you can read the source code at <a href=\"https://github.com/playframework/Play20/tree/master/framework/src/play/src/main/scala/play/api/libs/iteratee\">Play20 Github source code</a>.</p>\n<h3 id=\"generating-the-audio-stream\">Generating the audio stream</h3>\n<pre><code class=\"language-scala\">val (rawStream, channel) = Concurrent.broadcast[Array[Double]]  \nval zound = new ZoundGenerator(channel).start()\n</code></pre>\n<p>We create an <code>Array[Double]</code> broadcast which return two values: the <strong>rawStream</strong> will be used to read the generated data, and the <strong>channel</strong> used by the generator to push generated audio samples. We give this channel to the <strong>ZoundGenerator</strong>. The <code>.start()</code> then starts the audio generation. All of the generation is done using the JSyn library.</p>\n<p>Here’s a snippet from the <strong>ZoundGenerator</strong> class showing the connection between <strong>JSyn</strong> and <strong>Channel</strong>:</p>\n<pre><code class=\"language-scala\">class ZoundGenerator(output: Channel[Array[Double]]) {  \n  val out = new MonoStreamWriter()  \n  \n  val synth = {  \n    val synth = JSyn.createSynthesizer()  \n    synth.add(out)  \n    out.setOutputStream(new AudioOutputStream(){  \n      def close() {}  \n      def write(value: Double) {  \n        output.push(Array(value))  \n      }  \n      def write(buffer: Array[Double]) {  \n        write(buffer, , buffer.length)  \n      }  \n      def write(buffer: Array[Double], start: Int, count: Int) {  \n        output.push(buffer.slice(start, start count))  \n      }  \n    })  \n    synth  \n  }  \n  // ...\n</code></pre>\n<p>We have to implement the methods of AudioOutputStream – but it’s just a matter of pushing each audio sample to the channel. It’s that simple!</p>\n<h3 id=\"encoding-the-raw-audio-stream\">Encoding the raw audio stream</h3>\n<p>For now, we have only implemented the <a href=\"http://en.wikipedia.org/wiki/WAV\">WAVE format</a>. Basically, WAVE has 2 parts; the WAVE header which describes important information (like the framerate and the bits per sample), and the data.<br>The data is encoded in a simple manner I won’t describe here but you can look to the encoder I made here: </p>\n<p>Now more interesting, let’s wrap it with Play Iteratees:</p>\n<pre><code class=\"language-scala\">val audio = MonoWaveEncoder() // instanciate the WAV encoder  \nval audioHeader = Enumerator(audio.header)  \nval audioEncoder = Enumeratee.map[Array[Double]](audio.encodeData)\n</code></pre>\n<p><em><strong>N. B.</strong></em>: <em>Remember that Scala is a typed language but where the type declaration is optional because the compiler can infer the type.</em></p>\n<p><strong>audioHeader</strong> is an <code>Enumerator</code> which means it can <em>produce</em> data, and here the data is the audio header. More precisely it’s an <code>Enumerator[Array[Byte]]</code> because audio.header is an <code>Array[Byte]</code>. Note that contained data is not “consumed” like it would be for an <code>InputStream</code>. Each time you use this enumerator, it gives you its entire content.</p>\n<p><strong>audioEncoder</strong> is an <code>Enumeratee[Array[Double], Array[Byte]]</code>. It takes an <code>Array[Double]</code> from input and returns an <code>Array[Byte]</code> as output. The input is a raw array of audio samples (double numbers between -1.0 and 1.0). The output is the encoded array of bytes.</p>\n<p>More formally, an <code>Enumeratee[A, B]</code> is an <em>adapter</em> which maps some data of type A to new data of type B. You can implement the way the data is transformed with the map function. Here we just give it the <code>audio.encodeData</code> function.</p>\n<h3 id=\"streaming-it\">Streaming it</h3>\n<p>We can basically stream the audio stream with Play2 like so:</p>\n<pre><code class=\"language-scala\">def stream = Action {  \n  val audioStream = rawStream &amp;&gt; audioEncoder  \n  Ok.stream(audioHeader &gt;&gt;&gt; audioStream).  \n     withHeaders( (CONTENT_TYPE, audio.contentType) )  \n}\n</code></pre>\n<p>The <code>rawStream &amp;&gt; audioEncoder</code> takes the raw stream and <strong>pipes</strong> it into the encoder which results in the encoded audio stream. <code>audioHeader &gt;&gt;&gt; audioStream</code> will <strong>concatenate</strong> <code>audioHeader</code> with <code>audioStream</code>. Hence, the first thing the server will do is start sending the audio header to the client <strong>and then</strong> stream the audio in real-time.</p>\n<p><strong>A client can connect at any time and will hear current stream</strong>, so it should simultaneously hear the same thing as any other client (with some delay depending on the client buffer). If the generator stops emitting audio samples, the http client will stop receiving audio data – but it will still be waiting for the server, so the audio play will pause until the server re-sends new audio samples. <strong>That is pretty cool!</strong> – because of the way iteratees work, the stream doesn’t just die when all of the input is consumed.</p>\n<h4 id=\"a-chunker-to-reduce-http-packet-numbers\">A chunker to reduce HTTP packet numbers</h4>\n<p>Up to now we’ve been streaming the audio in <strong>very small chunks</strong> because by default JSyn writes out arrays of just 8 audio samples and the <code>.stream()</code> function consumes all data as it comes. This means <em>a lot</em> of HTTP chunks per second are sent – which is less efficient and take more bandwidth.</p>\n<p>In order to fix this, we need to use a <strong>buffer on the server side</strong>. In other words, instead of sending audio samples as they come we need to <strong>group audio samples</strong>. We have currently grouped audio samples in arrays of 5000 which is quite reasonable (it’s about 10 chunks per second using 44100 samples/s). We can easily change this later. This logic is implemented in an <code>Enumeratee</code> we called “chunker”. In that sense, it is reusable and modular:</p>\n<pre><code class=\"language-scala\">val chunker = Enumeratee.grouped(  \n  Traversable.take[Array[Double]](5000) &amp;&gt;&gt; Iteratee.consume()  \n)\n</code></pre>\n<p>And now, we can easily plug it in like this:</p>\n<pre><code class=\"language-scala\">def stream = Action {  \n  val chunkedAudioStream = rawStream &amp;&gt; chunker &amp;&gt; audioEncoder  \n  Ok.stream(audioHeader &gt;&gt;&gt; chunkedAudioStream).  \n     withHeaders( (CONTENT_TYPE, audio.contentType) )  \n}\n</code></pre>\n<h3 id=\"broadcast\">Broadcast</h3>\n<p>Now, another improvement we made was to <strong>factorize this chunking and encoding part: avoiding having this computing tasks done for every stream consumer</strong>.</p>\n<p>Basically, we move it out of the stream function:</p>\n<pre><code class=\"language-scala\">val chunkedAudioStream = rawStream &amp;&gt; chunker &amp;&gt; audioEncoder  \ndef stream = Action {  \n  Ok.stream(audioHeader &gt;&gt;&gt; chunkedAudioStream).  \n     withHeaders( (CONTENT_TYPE, audio.contentType) )  \n}\n</code></pre>\n<p>But to allow broadcasting, we have to use a broadcast:</p>\n<pre><code class=\"language-scala\">val chunkedAudioStream = rawStream &amp;&gt; chunker &amp;&gt; audioEncoder  \nval (sharedChunkedAudioStream, _) =  =   \n  Concurrent.broadcast(chunkedAudioStream)  \ndef stream = Action {  \n  Ok.stream(audioHeader &gt;&gt;&gt; sharedChunkedAudioStream).  \n     withHeaders( (CONTENT_TYPE, audio.contentType) )  \n}\n</code></pre>\n<p>Here we only care about the enumerator (the left argument in the Tuple2), we put the wildcard &quot;_&quot; to ignore the return value.</p>\n<p><a href=\"http://en.wikipedia.org/wiki/Broadcasting_(networking)\"><img src=\"/images/2012/07/320px-Broadcast.svg_.png\" alt=\"\"></a></p>\n<p>Using a broadcast, generated audio samples pushed by the audio generator can be simultaneously spread to multiple consumers. This is perfect for our needs, multiple players can connect to this web radio!</p>\n<h3 id=\"avoiding-the-server-load\">Avoiding the server load</h3>\n<p>The last important fix we made was to <strong>avoid the server load</strong>:</p>\n<pre><code class=\"language-scala\">  def stream = Action {  \n    Ok.stream(audioHeader &gt;&gt;&gt; sharedChunkedAudioStream   \n      &amp;&gt; Concurrent.dropInputIfNotReady(50)).  \n       withHeaders( (CONTENT_TYPE, audio.contentType) )  \n  }\n</code></pre>\n<p>If a client is opening the stream connection but doesn’t consume enough or doesn’t consume it at all (download is paused), the server will fill in memory the chunks to send to the client and the server can reach an <em>out of memory</em> exception. To avoid that <strong>we have to drops chunks if the consumer is not ready</strong>. Then the client will just lose messages if it is not ready (in our case, we give them 50 milliseconds).</p>\n<p>And this is what <code>Concurrent.dropInputIfNotReady(50)</code> is actually doing – with yet another <strong>Enumeratee</strong>! <strong>Dropping old chunks is really what we want in an audio streaming application</strong>: We want the consumer to subscribe to the current audio stream and not to continue from where they stopped.</p>\n<h3 id=\"client-consumers\">Client consumers</h3>\n<h4 id=\"html5-audio-tag\">HTML5 Audio tag</h4>\n<p>In HTML5, we have the Audio tag – and we can just consume our stream like this:</p>\n<pre><code class=\"language-html\">&lt;audio src=&quot;/stream.wav&quot;&gt;&lt;/audio&gt;\n</code></pre>\n<p>Or if we want to make it auto loading:</p>\n<pre><code class=\"language-html\">&lt;audio src=&quot;/stream.wav&quot; preload autoplay controls&gt;&lt;/audio&gt;\n</code></pre>\n<p>It may be a bit “wrong” to use `` for streaming, but it works because we are using it as if the server was hosting a static audio file. The only disputable hack is to have to set the max ChunkSize in the WAVE header which is 2147483647 (it’s about 6 hours 45mn!), so the browser believes the audio is not finished.</p>\n<p>The issue we are currently facing is this crazy latency (a few seconds) between user actions and the produced sound. This problem is due to the browser audio cache buffer: if we were able to minimize it we would have an almost real-time audio player.</p>\n<h4 id=\"playing-it-with-vlc\">Playing it with VLC</h4>\n<p>This stream is spread through HTTP so we need a HTTP client to consume it. But a HTTP client doesn’t mean only browsers! We can also use VLC for this, as if it was a web radio! One advantage of using VLC is it suffers far less latency (presumably because the cache buffer is smaller than the audio tag).</p>\n<p><img src=\"/images/2012/07/vlc.png\" alt=\"vlc\"></p>\n<h2 id=\"making-the-real-time-control-ui\">Making the real-time control UI</h2>\n<p>Our experiment <strong>mixes different oscillators to generator one sound</strong>. The web user interface allows a user to control the parameters of those. Two knobs control the <strong>volume</strong> and the <strong>pitch</strong> (tuned to a dorian mode scale) and you can select the oscillator <strong>wave primitive</strong> (sine, sawtooth, square, noise). It’s not fancy at the moment – but JSYN offers a lot of features for expanding our simple demo.</p>\n<p><img src=\"/images/2012/07/Capture-d%E2%80%99%C3%A9cran-2012-07-31-%C3%A0-16.42.15.png\" alt=\"\"></p>\n<p>This interface is <strong>multi-users</strong>, so if you use it with other people, <strong>the interface will stay synchronized over multiple browsers</strong> (turn the knobs, change the wave primitive, …). All this is done with WebSockets, and on the server-side it’s using, again, <strong>Iteratees</strong>!</p>\n<p>The workflow is simple: When someone does some action on the user interface, events are sent to the server. These events are interpreted by the <em>ZoundGenerator</em> resulting in updates to the audio synthesis configuration. These events are then broadcast to each client, and some Javascript handlers are called in order to keep the interface synchronized.</p>\n<h2 id=\"source-code\">Source code</h2>\n<p><strong><a href=\"http://github.com/gre/zound\">Fork me on Github</a></strong></p>\n<h2 id=\"whats-next\">What’s next?</h2>\n<p>This was just a simple demo to show the power and flexibility of Play2′s Iteratee concept. Because of the modular nature, extending the demo is easy. For example, we could plug a new audio encoder such an OGG encoder. The code would be simple and we could even choose on a request-by-request basis which encoder to use:</p>\n<pre><code class=\"language-scala\">import Concurrent.broadcast  \nval (chunkedWaveStream, _) =   \n  broadcast(rawStream &amp;&gt; chunker &amp;&gt; waveEncoder)  \nval (chunkedOggStream, _) =   \n  broadcast(rawStream &amp;&gt; chunker &amp;&gt; oggEncoder)  \n  \ndef stream(format: String) = Action {  \n  val stream = format match {  \n    case &quot;wav&quot; =&gt; waveHeader &gt;&gt;&gt; chunkedWaveStream  \n    case &quot;ogg&quot; =&gt; oggHeader &gt;&gt;&gt; chunkedOffStream  \n  }  \n  Ok.stream(stream).  \n     withHeaders( (CONTENT_TYPE, audio.contentType) )  \n}\n</code></pre>\n<p><strong>Now it’s up to you!</strong></p>\n<p>Hopefully you get a feel for the possibilities of stream processing and piping with Play. You can now reuse these concepts and make your own stuff: Maybe you don’t need to generate sounds on the fly, but instead you simply want to play a collection of audio files and stream them like radio? <strong>Well you can make a web radio engine now!</strong>. </p>\n<p>But that’s just the beginning – I would love to see someone taking the concept, and running even further… Do you know that in Youtube, during the time you are uploading a video, Youtube is already re-encoding it and can start streaming it <em>before</em> the file has finished uploading? Hmm, that’s starting to sound almost simple…</p>\n","data":{"title":"Zound, a PlayFramework 2 audio streaming experiment using Iteratees","description":"Zound uses an audio generator (JSyn, an audio synthesizer), encode the output and stream it all using Play Iteratees to pipe everything in real-time.","thumbnail":"/images/2012/07/ZOUND.png","author":"Gaetan","layout":"post","permalink":"/2012/08/zound-a-playframework-2-audio-streaming-experiment-using-iteratees/","tags":["audio","iteratee","playframework","hackday"]}},"__N_SSG":true}